{
  "data": [
    "In the realm of Gondor",
    "The land of Anurien is still passing by.",
    "What is that?",
    "Look! Fire, red fire! Are there dragons in this land? Look, there is another!",
    "It is long since the beacons of the North were lit",
    "Sleep again, and do not be afraid!",
    "You do not comfort me",
    "Yea truly, we know you, Mithrandir",
    "I will vouch for him before the seat of Denethor",
    "Man?",
    "Man!",
    "Many a doer of great deeds might say no more",
    "But what is a hobbit?",
    "A Halfling",
    "Nay, not the one that was spoken of",
    "Not he, yet one of his kindred.",
    "Yes, and one who journeyed with him",
    "And Boromir of your City was with us, and he saved me in the snows of the North, and at the last he was slain defending me from many foes.",
    "Peace!",
    "The news of that grief should have been told first to the father.",
    "It has been guessed already",
    "Hobbit",
    "Little service can I offer to your lord, but what I can do, I would do, remembering Boromir the brave.",
    "Fare you well!",
    "May you bring good counsel to Denethor in his need, and to us all, Mithrandir!",
    "But you come with tidings of grief and danger, as is your wont, they say.",
    "Now we know that the storm is indeed nigh!",
    "It is upon you",
    "Surely that is one of the great steeds of the King of Rohan? Maybe the Rohirrim will come soon to strengthen us.",
    "Why not? What is wrong with Strider?",
    "Maybe, maybe",
    "Kingship?",
    "Yes",
    "If you have walked all these days with closed ears and mind asleep, wake up now!",
    "Hail, Lord and Steward of Minas Tirith, Denethor son of Ecthelion! I am come with counsel and tidings in this dark hour.",
    "Dark indeed is the hour",
    "It is",
    "Yet a Halfling still",
    "He would have gone",
    "I have received this",
    "Verily",
    "What say you to that, Halfling?",
    "Thirteen, thirteen days",
    "So",
    "You were there? Tell me more! Why did no help come? And how did you escape, and yet he did not, so mighty a man as he was, and only Orcs to withstand him?",
    "The mightiest man may be slain by one arrow",
    "Whence came this?",
    "But only evil wights dwell there now, and I will not willingly tell more of them.",
    "I see that strange tales are woven about you",
    "Take the hilt",
    "I am",
    "And now",
    "Bring wine and food and seats for the guests",
    "It is all that I have to spare, for there is much else to heed",
    "And earlier, it is to be hoped",
    "How much older?",
    "Yea",
    "Now tell me your tale, my liege",
    "For the words of one whom my son so befriended will be welcome indeed.",
    "I could now eat three breakfasts on end.",
    "Lead the Lord Mithrandir to the housing prepared for him",
    "Folly?",
    "If you understand it, then be content",
    "Unless the king should come again?",
    "You did indeed!",
    "Indeed you did your best",
    "I am in haste Pippin",
    "You are Peregrin the Halfling?",
    "Well",
    "Aragorn?",
    "Who is he?",
    "Oh",
    "Er well",
    "An old campaigner, I see",
    "Well, yes, to speak in courtesy, yes",
    "Come! We will walk a little and then go find us some refreshment, and eat and drink on the battlement, and survey the fair morning.",
    "One moment!",
    "Hobbit?",
    "That is what we call ourselves",
    "I am glad to learn it",
    "He looks as if he were spoiling for a race, and not newly come from a great journey",
    "How strong and proud he is! Where is his harness? It should be rich and fair.",
    "None is rich and fair enough for him",
    "And now for our manger",
    "This is the storehouse and buttery of my company of the Guard.",
    "Greetings, Targon!",
    "I will not hide from you, Master Peregrin",
    "I do",
    "What can I see there?",
    "Is that another city, or what is it?",
    "It was a city",
    "The Black Riders?",
    "Yes, they were black",
    "I know of them",
    "So near to Mordor?",
    "When?",
    "Only because everything is now ready",
    "It is but the deep breath before the plunge.",
    "But why were the beacons lit last night?",
    "You also felt something?",
    "Yes",
    "It is the sign of our fall, and the shadow of doom, a Fell Rider of the air.",
    "Yes, the shadow of doom",
    "It is passed",
    "Rightly said!",
    "All the same, I wish it was over for good or ill.",
    "Ah, there you lay your finger on the sore that many feel!",
    "Alas! my own hand feels as light as a feather",
    "A pawn did Gandalf say? Perhaps but on the wrong chessboard.",
    "Will you come with me?",
    "I shall be glad to come",
    "Nay, nay",
    "Then it is far beyond me",
    "Farewell for this time!",
    "Greetings!",
    "Oh come!",
    "Which question shall I answer first?",
    "I wager I could stand you on your head or lay you on your back.",
    "Maybe you could, if I let you",
    "No!",
    "I am Bergil son of Beregond of the Guards",
    "So I thought",
    "Then why did you not say so at once?",
    "Do not tell me that he has changed his mind, and will send me away with the maidens! But no, the last wains have gone.",
    "His message is less bad than that, if not good.",
    "All is well",
    "What is happening there?",
    "That is good!",
    "There is dust away there! They are coming!",
    "Forlong! Forlong!",
    "What do they say?",
    "Forlong has come",
    "Forlong!",
    "True heart, true friend! Forlong!",
    "Come! There goes the trumpet for the closing of the Gate.",
    "Farewell for this time",
    "Can you find your way?",
    "When will Faramir return?",
    "Hullo!",
    "But the night will be too short",
    "So four of the Company still remain",
    "And then whither?",
    "I cannot say yet",
    "I for one!",
    "And Gimli with him!",
    "Well, for myself",
    "Yes",
    "My lord",
    "No good!",
    "Halt! Halt! Who rides in Rohan?",
    "You have found it",
    "We seek one Aragorn son of Arathorn, and we heard that he was in Rohan.",
    "And you have found him also!",
    "Halbarad!",
    "Of all joys this is the least expected!",
    "All is well",
    "I have thirty with me",
    "But I did not summon you",
    "It is well!",
    "If these kinsmen be in any way like to yourself, my lord Aragorn, thirty such knights will be a strength that cannot be counted by heads.",
    "Always my days have seemed to me too short to achieve my desire",
    "But great indeed will be my haste ere I take that road.",
    "That will soon be seen",
    "But let us speak no more of these things upon the open road!",
    "What is that that you bear, kinsman?",
    "It is a gift that I bring you from the Lady of Rivendell",
    "There was a battle here three nights ago",
    "Nay! There is no time",
    "Where is Aragorn?",
    "In a high chamber of the Burg",
    "They are a strange company, these newcomers",
    "But even as Aragorn they are courteous, if they break their silence.",
    "Why have they come? Have you heard?",
    "They answered a summons, as you heard",
    "Nay, Galadriel",
    "Did she not speak through Gandalf of the ride of the Grey Company from the North?",
    "Yes, you have it",
    "I do not think that any would come",
    "It is not as I would have it",
    "May I?",
    "That would be splendid!",
    "I doubt it not",
    "I have a sword",
    "May I lay the sword of Meriadoc of the Shire on your lap Thjoden King?",
    "Receive my service, if you will!",
    "Gladly will I take it",
    "Rise now, Meriadoc, esquire of Rohan of the household of Meduseld!",
    "Take your sword and bear it unto good fortune!",
    "As a father you shall be to me",
    "For a little while",
    "It is near the hour that we set for our going, lord",
    "Shall I bid men sound the horns? But where is Aragorn? His place is empty and he has not eaten.",
    "We will make ready to ride",
    "I am troubled in mind, lord",
    "It is now a full hour past noon",
    "Three days",
    "The Paths of the Dead!",
    "Why do you speak of them?",
    "If there be in truth such paths",
    "Alas! Aragorn my friend!",
    "That road I will take, nonetheless",
    "But I say to you, Jomer, that in battle we may yet meet again, though all the hosts of Mordor should stand between.",
    "You will do as you will, my lord Aragorn",
    "There go three that I love, and the smallest not the least",
    "Little do they know of our long labour for the safekeeping of their borders, and yet I grudge it not.",
    "And now our fates are woven together",
    "Come!",
    "Speak and be comforted, and shake off the shadow! What has happened since we came back to this grim place in the grey morning?",
    "A struggle somewhat grimmer for my part than the battle of the Hornburg",
    "I have looked in the Stone of Orthanc, my friends.",
    "You have looked in that accursed stone of wizardry!",
    "You forget to whom you speak",
    "Did I not openly proclaim my title before the doors ofEdoras? What do you fear that I should say to him? Nay, Gimli",
    "But he wields great dominion, nonetheless",
    "The hasty stroke goes oft astray",
    "Then lost it must be",
    "For what help is there to send thither, and how could it come there in time?",
    "I have no help to send, therefore I must go myself",
    "The Paths of the Dead!",
    "And what may be the words of the seer?",
    "Dark ways doubtless, said Gimli, but no darker than these staves are to me.",
    "If you would understand them better, then I bid you come with me",
    "I will go with you even on the Paths of the Dead, and to whatever, end they may lead",
    "I also will come",
    "I hope that the forgotten people will not have forgotten how to fight",
    "That we shall know if ever we come to Erech",
    "Then it was kindly done, lord, to ride so many miles out of your way to bring tidings to Jowyn, and to speak with her in her exile.",
    "Indeed no man would count such a journey wasted",
    "Nay, lady",
    "But, Aragorn",
    "They may suffer me to pass",
    "But this is madness",
    "It is not madness, lady",
    "Aragorn",
    "You are a stern lord and resolute",
    "Lord.",
    "Your duty is with your people",
    "Too often have I heard of duty",
    "Few may do that with honour",
    "Shall I always be chosen?",
    "Shall I always be left behind when the Riders depart, to mind the house while they win renown, and find food and beds when they return?",
    "A time may come soon",
    "What do you fear, lady?",
    "A cage",
    "To stay behind bars, until use and old age accept them, and all chance of doing great deeds is gone beyond recall or desire.",
    "And yet you counselled me not to adventure on the road that I had chosen, because it is perilous?",
    "Nor would I",
    "Aragorn, wilt thou go?",
    "I will",
    "Then wilt thou not let me ride with this company, as I have asked?",
    "I will not, lady",
    "I beg thee!",
    "Nay, lady",
    "My blood runs chill",
    "This is an evil door",
    "But we must go in, and therefore the horses must go too",
    "Here is a thing unheard of!",
    "An Elf will go underground and a Dwarf dare not!",
    "Does he feel no fear?",
    "For that is not my errand!",
    "The King of the Dead! The King of the Dead is come upon us!",
    "Oathbreakers, why have ye come?",
    "I am forgetting them!",
    "Harrowdale at last!",
    "Our journey is almost at an end.",
    "This journey is over, maybe",
    "But if you would take my counsel",
    "Nay, my son, for so I will call you, speak not the soft words of Wormtongue in my old ears!",
    "Thjoden King! Thjoden King! The King of the Mark returns!",
    "At dawn three days ago, lord",
    "The winged Shadow?",
    "We saw it also, but that was in the dead of night before Gandalf left us.",
    "Maybe, lord",
    "It is well",
    "Hail, Lord of the Mark!",
    "And you, Jowyn",
    "All is well",
    "So Aragorn has come then",
    "Is he still here?",
    "No, he is gone",
    "Whither did he go?",
    "I do not know",
    "You are grieved, daughter",
    "What has happened? Tell me, did he speak of that road?",
    "Of the Paths of the Dead?",
    "Yes, lord",
    "Then our paths are sundered",
    "The Paths of the Dead",
    "Come, Master Meriadoc!",
    "Twice now, lord, I have heard of the Paths of the Dead",
    "What are they? And where has Strider, I mean the Lord Aragorn where has he gone?",
    "We do not know, and our hearts are heavy",
    "No man knows",
    "Yet it is said in Harrowdale",
    "Then why has Aragorn gone that way?",
    "Unless he has spoken words to you as his friend that we have not heard",
    "Maybe he was called",
    "But how shall a man discover whether that time be come or no, save by daring the Door?",
    "A man is here, lord",
    "Let him come!",
    "Hail Lord of the Rohirrim, friend of Gondor!",
    "The Red Arrow!",
    "The Red Arrow has not been seen in the Mark in all my years ! Has it indeed come to that? And what does the Lord Denethor reckon that all my strength and all my speed may be?",
    "That is best known to yourself, lord",
    "But ere long it may well come to pass that Minas Tirith is surrounded, and unless you have the strength to break a siege of many powers, the Lord Denethor bids me say that he judges that the strong arms of the Rohirrim would be better within his walls than without.",
    "What the Lord Denethor may know or guess of all these things I cannot say",
    "Dark tidings",
    "A week!",
    "At the least we will do that",
    "Go now each to your rest.",
    "I will be ready",
    "Speak not words of omen!",
    "What is the matter?",
    "The king calls for you.",
    "But the Sun has not risen, yet",
    "It comes from Mordor, lord",
    "So we come to it in the end",
    "We have very great store long prepared",
    "Then call the heralds, Jomer",
    "Let the Riders be marshalled!",
    "I am going to war, Master Meriadoc",
    "But, but, lord",
    "But we ride on horses tall and swift",
    "Then tie me on to the back of one, or let me hang on a stirrup, or something",
    "Rather than that I would bear you with me on Snowmane",
    "Come now, Meriadoc!",
    "I will show you the gear that I have prepared fur you.",
    "This request only did Aragorn make to me",
    "No mail have we to fit you",
    "Take all these things",
    "As for that, who can tell?",
    "Where will wants not, a way opens, so we say",
    "I do",
    "Then you shall go with me",
    "Thank you indeed!",
    "Thank you, sir, though I do not know your name.",
    "Do you not?",
    "Then call me Dernhelm.",
    "Ride on! Ride on!",
    "And will he provide breakfast?",
    "Why did you bring me here?",
    "You know quite well",
    "Well, Master Peregrin, I hope that you used yesterday to your profit, and to your liking? Though I fear that the board is barer in this city than you could wish.",
    "What would you do in my service?",
    "I thought, sir, that you would tell me my duties.",
    "I will, when I learn what you are fit for",
    "Go to the armouries of the Citadel",
    "You are weary of this day?",
    "Yes",
    "Nay",
    "Yes",
    "They have come!",
    "Take courage and look! There are fell things below.",
    "Black Riders!",
    "Black Riders of the air! But see, Beregond!",
    "Faramir! The Lord Faramir! It is his call!",
    "Faramir!",
    "Faramir!",
    "Whence come you?",
    "He came with me from the land of the Halflings",
    "But now we come to strange matters",
    "For this is not the first halfling that I have seen walking out of northern legends into the Southlands.",
    "Cirith Ungol? Morgul Vale?",
    "The time, Faramir, the time? When did you part with them? When would they reach that accursed valley?",
    "I parted with them in the morning two days ago",
    "If what I have done displeases you, my father",
    "I wish I had known your counsel before the burden of so weighty a judgement was thrust on me.",
    "Would that have availed to change your judgement?",
    "So be it",
    "So be it!",
    "Do you wish then",
    "Yes, I wish that indeed",
    "Stir not the bitterness in the cup that I mixed for myself",
    "Comfort yourself!",
    "You found Boromir less apt to your hand, did you not?",
    "What then is your wisdom?",
    "And the Lord Denethor what would he have done?",
    "You think, as is your wont, my lord, of Gondor only",
    "And where will other men look for help, if Gondor falls?",
    "Nonetheless I do not trust you",
    "If I had! If you had!",
    "What think you of the garrison at Osgiliath?",
    "It is not strong",
    "I have sent the company of Ithilien to strengthen it, as I have said.",
    "Not enough, I deem",
    "There and elsewhere in many places",
    "Alas for my brother, whom I too loved!",
    "May I have your leave, father?",
    "You are weary, I see",
    "You have ridden fast and far, and under shadows of evil in the air, I am told.",
    "Let us not speak of that!",
    "Then we will not",
    "There never was much hope",
    "Cirith Ungol!",
    "Why that way, I wonder?",
    "Maybe",
    "But",
    "But what?",
    "Only one but will I allow tonight.",
    "Gollum",
    "I cannot answer that now",
    "They give him no rest",
    "The Lord drives his son too hard, and now he must do the duty of two, for himself and for the one that will not return.",
    "Where are the Riders of Rohan?",
    "Yet",
    "That was but a trial",
    "And what of Cair Andros?",
    "Much must be risked in war",
    "I do so",
    "But if I should return, think better of me!",
    "That depends on the manner of your return",
    "Do not throw your live away rashly or in bitterness",
    "Will he come? Will he remember our old alliance?",
    "Yes, he will come",
    "If he wins back at all across the Pelennor, his enemies will be on his heels",
    "Then I am needed there more than here",
    "They have taken the wall!",
    "Where is Faramir?",
    "Say not that he has fallen!",
    "Is Faramir come?",
    "No",
    "Thus have I walked, and thus now for many years have I slept",
    "King of Angmar long ago, Sorcerer, Ringwraith, Lord of the Nazgyl, a spear of terror in the hand of Sauron, shadow of despair.",
    "Then, Mithrandir, you had a foe to match you",
    "It might be so",
    "We are likely to see other newcomers first",
    "Some have accused you, Mithrandir, of delighting to bear ill news",
    "The enemy",
    "Faramir must be there",
    "Amroth for Gondor!",
    "Faramir! Faramir!",
    "Nay",
    "Comfort me not with wizards!",
    "Nay, I will not come down",
    "The first circle of the City is burning, lord",
    "Why? Why do the fools fly?",
    "Fie is burning, already burning",
    "The house of his spirit crumbles.",
    "Farewell!",
    "I will not say farewell, my lord",
    "I will take your leave, sir",
    "Do as you will, Master Halfling",
    "Here we will wait",
    "By your leave, lord!",
    "Poor Faramir!",
    "Your master is not himself",
    "Go slow! Bring no fire to this place while Faramir lives! Do nothing until Gandalf comes!",
    "Who is the master of Minas Tirith?",
    "The Lord Denethor or the Grey Wanderer?",
    "The Grey Wanderer or no one, it would seem",
    "Whither do you run, Master Peregrin?",
    "To find Mithrandir",
    "Yes",
    "They said that he was dying",
    "No",
    "I must find Gandalf at once.",
    "Then you must go down to the battle.",
    "The Lord does not permit those who wear the black and silver to leave their post for any cause, save at his own command.",
    "Well, you must choose between orders and the life of Faramir",
    "You cannot enter here",
    "Is the enemy coming then?",
    "Are those their drums? I began to think I was imagining them, as no one else seemed to take any notice of them.",
    "Nay, nay",
    "But our need is for aid in battle",
    "How will you and your folk help us?",
    "Bring news",
    "How do you know that?",
    "Wild men are wild, free, but not children",
    "Alas! he speaks all too shrewdly",
    "And yet we need great haste",
    "Mundburg is on fire!",
    "We will receive your offer",
    "Dead men are not friends to living men, and give them no gifts",
    "So be it!",
    "How long will it take to pass by the enemy and come back to the road?",
    "Wild Men go quick on feet",
    "Way is wide for four horses in Stonewain Valley yonder",
    "Then we must allow at least seven hours for the leaders",
    "Who knows?",
    "All is night now.",
    "It is all dark, but it is not all night.",
    "Then we must set out as soon as may be",
    "Good tidings!",
    "Good fortune go with you for tidings and for guidance!",
    "Drive away bad air and darkness with bright iron!",
    "To do these things we have ridden far",
    "Wind is changing!",
    "We need no further guidance",
    "Then since we must look for fell deeds and the need of all our strength",
    "I counsel that we rest now, and set out hence by night, and so time our going that we come upon the fields when tomorrow is as light as it will be, or when our lord gives the signal.",
    "The scouts have found naught to report beyond the grey wood, lord",
    "Well?",
    "What of it?",
    "Alas!",
    "Then Denethor has heard no news of our riding and will despair of our coming.",
    "Need brooks no delay, yet late is better than never",
    "And mayhap in this time shall the old saw be proved truer than ever before since men spoke with mouth.",
    "There are great fires, lord",
    "If you speak truly, Wndfara, then may you live beyond this day in years of blessedness!",
    "Up Eorlingas! Fear no darkness!",
    "Begone, foul dwimmerlaik, lord of carrion! Leave the dead in peace!",
    "Farewell, Master Holbytla!",
    "Forgive me, lord",
    "Lord, lord",
    "Where is Gandalf? Is he not here? Could he not have saved the king and Jowyn?",
    "Hail, King of the Mark!",
    "Ride now to victory! Bid Jowyn farewell!",
    "Thjoden King! Thjoden King!",
    "Let his knights remain here",
    "Jowyn, Jowyn!",
    "Jowyn, how come you here? What madness or devilry is this? Death, death, death! Death take us all!",
    "What burden do you bear, Men of Rohan?",
    "Thjoden King",
    "Surely, here is a woman?",
    "Have even the women of the Rohirrim come to war in our need?",
    "Nay! One only",
    "Men of Rohan!",
    "Are there no leeches among you? She is hurt to the death maybe, but I deem that she yet lives.",
    "Haste now is needed",
    "Back to the walls!",
    "Back to the walls! Come back to the City before all are overwhelmed!",
    "Thus we meet again, though all the hosts of Mordor lay between us",
    "Did I not say so at the Hornburg?",
    "So you spoke",
    "Nor indeed more timely",
    "Then let us avenge it, ere we speak of it!",
    "Is it not a law in the City that those who wear the black and silver must stay in the Citadel, unless their lord gives them leave?",
    "He has",
    "But Faramir!",
    "He is not dead, and they will burn him alive, if someone does not stop them.",
    "Burn him alive?",
    "What is this tale? Be quick!",
    "Denethor has gone to the Tombs",
    "Maybe I can",
    "Darkness is passing",
    "Then Beregond has gone",
    "Work of the Enemy!",
    "Lor, my friend",
    "Stay! Stay!",
    "Stay this madness!",
    "Haste, haste! Do as I have bidden! Slay me this renegade! Or must I do so myself?",
    "What is this, my lord?",
    "Since when has the Lord of Gondor been answerable to thee?",
    "Or may I not command my own servants?",
    "You may",
    "He lies within",
    "Do not take my son from me! He calls for me.",
    "He calls",
    "He will not wake again",
    "Authority is not given to you, Steward of Gondor, to order the hour of your death",
    "And only the heathen kings, under the domination of the Dark Power, did thus, slaying themselves in pride and despair, murdering their kin to ease their own death.",
    "Come!",
    "Pride and despair!",
    "Hope on then!",
    "What then would you have",
    "I would have things as they were in all the days of my life",
    "To me it would not seem that a Steward who faithfully surrenders his charge is diminished in love or in honour",
    "And at the least you shall not rob your son of his choice while his death is still in doubt.",
    "So!",
    "Come hither!",
    "Come, if you are not all recreant!",
    "So passes Denethor, son of Ecthelion",
    "My friends",
    "Now I understand what seemed so strange to me!",
    "It was in the very hour that Faramir was brought to the Tower that many of us saw a strange light in the topmost chamber",
    "But we have seen that light before, and it has long been rumoured in the City, that the Lord would at times wrestle in thought with his Enemy.",
    "Alas! then I have guessed rightly",
    "Well, Merry! Thank goodness I have found you!",
    "Where is the king?",
    "And Jowyn?",
    "They have gone up into the Citadel",
    "No",
    "Well, you had better come with me as quick as you can",
    "Lean on me, Merry lad!",
    "Are you going to bury me?",
    "No, indeed!",
    "No, we are going to the Houses of Healing.",
    "Hullo, Bergil!",
    "Where are you going? Glad to see you again, and still alive!",
    "I am running errands for the Healers",
    "I cannot stay.",
    "He should have been borne in honour into this city",
    "And yet here is another charge on my hands, while all the time the battle hangs in the balance.",
    "I have been too busy with this and that to heed all the crying and shouting",
    "All I hope is that those murdering devils do not come to this House and trouble the sick.",
    "No",
    "Not a beggar",
    "Say a captain of the Rangers, who are unused to cities and houses of stone.",
    "Where is the Steward? And where also is Mithrandir?",
    "The Steward of Gondor is in the Houses of Healing.",
    "He is come.",
    "Well met indeed!",
    "Is it thus that we speak to our kings? Yet maybe he will wear his crown in some other name!",
    "For",
    "Here I must put forth all such power and skill as is given to me",
    "Would that Elrond were here, for he is the eldest of all our race, and has the greater power.",
    "First you must rest, surely, and at the least eat a little?",
    "You have store in this House of the herbs of healing?",
    "Yes, lord",
    "I will judge that when I see",
    "I do not know, I am sure, lord",
    "It is also called kingsfoil",
    "Oh that!",
    "Wholesome verily",
    "And now, dame, if you love the Ford Faramir, run as quick as your tongue and get me kingsfoil, if there is a leaf in the City.",
    "And if not",
    "He is nearly spent",
    "I drew it forth",
    "I do so",
    "Your pardon lord!",
    "Then in the name of the king, go and find some old man of less lore and more wisdom who keeps some in his house!",
    "It is kingsfoil, Sir",
    "It will serve",
    "Well now! Who would have believed it?",
    "Walk no more in the shadows, but awake!",
    "I will, lord",
    "For who would lie idle when the king has returned?",
    "Farewell then for a while!",
    "I must go to others who need me.",
    "I marvel that you should ask me, lord",
    "My friend",
    "Awake, Jowyn, Lady of Rohan!",
    "Awake! The shadow is gone and all darkness is washed clean!",
    "Call her!",
    "Jowyn, Jowyn!",
    "Not long, my sister",
    "But think no more on it!",
    "He is dead",
    "That is grievous",
    "He lies nearby in this House, and I will go to him",
    "To health?",
    "Poor old Merry!",
    "Do not be afraid",
    "They will indeed",
    "And anything else that this Rider of Rohan may desire, if it can be found in Minas Tirith, where his name is in honour.",
    "Good!",
    "Then I would like supper first, and after that a pipe.",
    "Why not?",
    "Well",
    "Smoke then, and think of him!",
    "Well then",
    "Master Meriadoc",
    "I am frightfully sorry",
    "May the Shire live for ever unwithered!",
    "Was there ever any one like him?",
    "No",
    "The Lady Jowyn",
    "As for Faramir",
    "It is likely that he will be fit to arise tomorrow, for a short while",
    "They are a remarkable race",
    "Very tough in the fibre, I deem.",
    "The King is come again indeed.",
    "It is good to learn that they are still alive",
    "They need more gardens",
    "Hail, lord!",
    "So it is said in the lore of my land",
    "You will find them in the Houses of Healing, and I will lead you thither",
    "It will be enough if you send one to guide us, lord",
    "We will come",
    "That is a fair lord and a great captain of men",
    "If Gondor has such men still in these days of fading, great must have been its glory in the days of its rising.",
    "Yet seldom do they fail of their seed",
    "To that the Elves know not the answer",
    "Look!",
    "Dull and dreary indeed!",
    "The Sun may shine here",
    "The Paths of the Dead?",
    "Not willingly",
    "And by the love of him also",
    "Alas! I had heart only for myself",
    "Nay! I will not speak of that journey.",
    "Four days and nights, and on into a fifth, we rode from the Black Stone",
    "Strange indeed",
    "Beyond the eyes of the Dwarves are such foretellings",
    "And that may well befall",
    "And I for the folk of the Great Wood",
    "My lords",
    "That would be no new counsel",
    "I did so ere I rode from the Flornburg",
    "But how is this?",
    "He is not yet sure",
    "As for myself",
    "As for me",
    "That is true",
    "All are weary, and very many have wounds light or grievous",
    "The Gate is destroyed",
    "In Erebor in the Kingdom of Dbin there is such skill",
    "No, he will try to trap the fly and take the sting",
    "Neither shall we",
    "You are not fit for such a journey",
    "The Lords of Gondor have returned and all this land that is theirs they take back.",
    "And, maybe",
    "It is but a feint",
    "Go!",
    "Come forth!",
    "I am the Mouth of Sauron.",
    "Is there anyone in this rout with authority to treat with me?",
    "Or indeed with wit to understand me? Not thou at least!",
    "I am a herald and ambassador, and may not be assailed!",
    "Where such laws hold",
    "So!",
    "I do not wish to deny them",
    "Good, good!",
    "Name the terms",
    "These are the terms",
    "Do not bandy words in your insolence with the Mouth of Sauron!",
    "These we will take!",
    "These we will take in memory of our friend",
    "This was made for just such an hour",
    "So it ends as I guessed it would",
    "The Eagles are coming! The Eagles are coming!",
    "Bilbo!",
    "Better have a look at the worst",
    "No good blundering about in a fog!",
    "And anyway all these notions are only a trick",
    "Now for it!",
    "Wrong again, I expect",
    "Beyond all towers strong and high",
    "Only that?",
    "Yes, I can walk",
    "Yes, they quarrelled, seemingly",
    "Here it is!",
    "No, no!",
    "O Sam!",
    "Take care, Sam!",
    "And be quick! There may be Orcs still alive, lurking in wait.",
    "What about you, Sam?",
    "There!",
    "Gilthoniel, A Elbereth!",
    "Quick, Sam! Over we go!",
    "Not even a leather jerkin is any good.",
    "Now down we go, Sam",
    "Down into the valley quick, and then turn northward, as soon as ever we can.",
    "It only makes it worse.",
    "Wake up, Sam!",
    "Weill never!",
    "But we may have some to do",
    "Look here, Sam dear lad",
    "What I really need is something warm",
    "Well no, not much, Sam",
    "If ever I see the Lady again, I will tell her!",
    "Light and now water!",
    "This is where we turn aside, Sam",
    "And we must turn east.",
    "I must rest now, Sam, and sleep if I can.",
    "I dare say I shall, if we ever get so far",
    "Nar!",
    "Not much use are you, you little snufflers?",
    "I reckon eyes are better than your snotty noses.",
    "Then what have you seen with them?",
    "Ar !",
    "All right, all right!",
    "Well, I hope they get him and put him through it",
    "It saved his life anyhow",
    "Garn! You missed him",
    "You come back",
    "You cursed peaching sneakthief!",
    "Well I call that neat as neat",
    "If this nice friendliness would spread about in Mordor, half our trouble would be over.",
    "Quietly, Sam",
    "Well, I suppose we must be going on again",
    "I wonder how long it will be before we really are caught and all the toiling and the slinking will be over, and in vain.",
    "No, not any clear notion, Sam",
    "We have come to a dead end, Sam",
    "All right, Sam",
    "Well, here goes, Master!",
    "Well, luck did not let me down",
    "Bless you, Sam!",
    "But he might do a bit of robbery and murder on his own",
    "I feared it, Sam",
    "Seems so",
    "Well, we can but wait and see.",
    "If only they are in a hurry and will let a couple of tired soldiers alone and pass on!",
    "Hi, you! Get up!",
    "Come on, you slugs!",
    "This is no time for slouching.",
    "Deserting, eh?",
    "No, not at the rear!",
    "There now!",
    "One more crawl, and then you can lie still.",
    "I can manage it",
    "I must.",
    "Water, water!",
    "Wake up, Master!",
    "Time for another start.",
    "It is such a weight to carry, such a weight.",
    "Then let me carry it a bit for you, Master",
    "You know I would, and gladly, as long as I have any strength.",
    "No, no, Sam",
    "I understand",
    "No",
    "No, I am afraid not, Sam",
    "But that was years ago",
    "I can go on a good way though, and I will.",
    "Where to?",
    "The Cracks of Doom",
    "There you are!",
    "Now for it! Now for the last gasp!",
    "How far is there to go?",
    "Now, now, or it will be too late!",
    "Wicked masster!",
    "Down, down!",
    "Begone, and trouble me no more! If you touch me ever again, you shall be cast yourself into the Fire of Doom.",
    "Fook out!",
    "Quick, Master!",
    "Yes, I must go on",
    "Now!",
    "At last I can deal with you!",
    "Dusst!",
    "Oh, curse you, you stinking thing!",
    "Frodo! Master!",
    "I have come",
    "Precious, precious, precious!",
    "My Precious! O my Precious!",
    "Well, this is the end, Sam Gamgee",
    "Master!",
    "Your poor hand!",
    "Yes",
    "The realm of Sauron is ended!",
    "Twice you have borne me, Gwaihir my friend",
    "I would bear you",
    "Then come, and let your brother go with us, and some other of your folk who is most swift! For we have need of speed greater than any wind, outmatching the wings of the Nazgyl.",
    "The North Wind blows, but we shall outfly it",
    "I am glad that you are here with me",
    "Here at the end of all things, Sam.",
    "Yes, I am with you, Master",
    "Maybe not, Sam",
    "Well, Master Samwise, how do you feel?",
    "A great Shadow has departed",
    "How do I feel?",
    "Yes, I am all right otherwise",
    "Noon?",
    "Noon of what day?",
    "The fourteenth of the New Year",
    "The clothes that you wore on your way to Mordor",
    "What have you got there?",
    "Yes, Sam, Strider",
    "It is a long way, is it not, from Bree, where you did not like the look of me? A long way for us all but yours has been the darkest road.",
    "Praise them with great praise!",
    "O great glory and splendour! And all my wishes have come true!",
    "Tonight at least you should wear one",
    "Sting I gave to you Sam",
    "There are indeed",
    "That you certainly are not",
    "Weeks indeed",
    "The hands of the King are hands of healing, dear friends",
    "And I",
    "But I missed a lot, seemingly.",
    "I am in great unrest, and I cannot lie longer in sloth.",
    "Lady",
    "I am healed",
    "There are no tidings",
    "Is there no deed to do?",
    "Who commands in this City?",
    "I do not rightly know",
    "Where can I find him?",
    "Will you not bring me to him? Then you will know.",
    "My lord",
    "Do not misunderstand him, lord",
    "What would you have me do, lady?",
    "I also am a prisoner of the healers.",
    "If it lies in my power, I will do it.",
    "I would have you command this Warden, and bid him let me go",
    "But I do not desire healing",
    "I wish to ride to war like my brother Jomer, or better like Thjoden the king, for he died and has both honour and peace.",
    "It is too late, lady, to follow the Captains, even if you had the strength",
    "But the healers would have me lie abed seven days yet",
    "And my window does not look eastward.",
    "Your window does not look eastward?",
    "How should I ease your care, my lord?",
    "And I do not desire the speech of living men.",
    "Would you have my plain answer?",
    "I would.",
    "Alas, not me, lord!",
    "But I doubt not, lord",
    "Does not the Black Gate lie yonder?",
    "And must he not now be come thither? It is seven days since he rode away.",
    "Seven days",
    "Lose what you have found, lord?",
    "Yes, we wait for the stroke of doom",
    "Yes",
    "Then you think that the Darkness is coming?",
    "Darkness Unescapable?",
    "No",
    "Jowyn, why do you tarry here, and do not go to the rejoicing in Cormallen beyond Cair Andros, where your brother awaits you?",
    "Do you not know?",
    "Two reasons there may be, but which is true, 1 do not know.",
    "Then if you will have it so, lady",
    "I wished to be loved by another",
    "That I know",
    "No longer do I desire to be a queen",
    "That is well",
    "Then must I leave my own people, man of Gondor?",
    "I would",
    "Here is the Lady Jowyn of Rohan, and now she is healed.",
    "Nay, cousin! they are not boys",
    "The last Steward of Gondor begs leave to surrender his office.",
    "So it must be, for you are appointed to the White Company, the Guard of Faramir, Prince of Ithilien, and you shall be its captain and dwell in Emyn Arnen in honour and peace, and in the service of him for whom you risked all, to save him from death.",
    "For",
    "Minas Ithil in Morgul Vale shall be utterly destroyed, and though it may in time to come be made clean, no man may dwell there for many long years.",
    "At last all such things must end",
    "As for Bilbo",
    "Pippin",
    "I know it well, dear friend",
    "Not for long now",
    "But I shall die",
    "Turn your face from the green world, and look where all seems barren and cold!",
    "The sign has been given",
    "It is true that I wish to go back to the Shire",
    "Then I beg leave to depart soon",
    "In seven days we will go",
    "Nay, lord",
    "You shall judge",
    "Well, lord",
    "Alas!",
    "I will not say that she is the fairest lady that lives.",
    "Then I must go for my axe",
    "But first I will plead this excuse",
    "Nay, you are excused for my part, lord",
    "Hail, Jomer, King of the Mark!",
    "Thus",
    "No niggard are you, Jomer",
    "Farewell now, Meriadoc of the Shire and Holdwine of the Mark! Ride to good fortune, and ride back soon to our welcome!",
    "This is an heirloom of our house",
    "And never before has a Dwarf claimed a victory over an Elf in a contest of words",
    "Now therefore let us go to Fangorn and set the score right!",
    "Welcome to the Treegarth of Orthanc!",
    "Well, come now!",
    "To see how your work goes, my friend",
    "Hoom, well, that is fair enough",
    "We know it well",
    "The New Age begins",
    "Ah!",
    "Then why did he stay to listen? Did you go into Orthanc?",
    "Hoom, no, not into Orthanc!",
    "You may be right",
    "That will be seen later",
    "But I will give to Ents all this valley to do with as they will, so long as they keep a watch upon Orthanc and see that none enter it without my leave.",
    "It is locked",
    "Now I thank you once more",
    "Forests may grow",
    "Yet maybe there is now more hope in your search",
    "Lands will lie open to you eastward that have long been closed.",
    "Come, Gimli!",
    "Here then at last comes the ending of the Fellowship of the Ring",
    "Yet I hope that ere long you will return to my land with the help that you promised.",
    "We will come, if our own lords allow it",
    "It is long, long since we met by stock or by stone, A vanimar, vanimblion nostari!",
    "I do not know, Eldest.",
    "Well, my merry folk",
    "Indeed we will",
    "Take care take care!",
    "For you have already grown since I saw you last.",
    "I wish we could have a Stone that we could see all our friends in",
    "Only one now remains that you could use",
    "Kinsman, farewell! May your doom be other than mine, and your treasure remain with you to the end!",
    "Well Saruman!",
    "What is that to you?",
    "Will you still order my goings, and are you not content with my ruin?",
    "You know the answers",
    "Then all the A more reason to have left sooner",
    "Then once more you are going the wrong way",
    "To me?",
    "Saruman",
    "If it be truly the last, I am glad",
    "Go!",
    "It will be a grey ship, and full of ghosts.",
    "Get up, you idiot!",
    "Then leave him!",
    "So you have come to gloat too, have you, my urchins?",
    "I would, if I had any",
    "You can have what I have got left",
    "Take what there is",
    "Mine, mine, yes and dearly bought!",
    "Thank you!",
    "One thief deserves another",
    "Well, I like that!",
    "Ah!",
    "Yes, I think you had better do that",
    "I wish I was going back to Lurien!",
    "Hullo, hullo!",
    "How splendid! How wonderful! But where were we?",
    "I was invited to the wedding of course",
    "Yes, something of everything, Sam, except the Sea",
    "Except the Sea.",
    "Well, if you must go, you must",
    "Almost the last drop of the Smaug vintage",
    "I have nothing much to give to you young fellows",
    "But if you want to beat the Old Took",
    "Think of me when you smoke them!",
    "I have lost it, Bilbo dear",
    "I got rid of it, you know.",
    "What a pity!",
    "You see, I am getting so sleepy",
    "That really is a very great relief to my mind.",
    "Are you in pain, Frodo?",
    "Well, yes I am",
    "Alas! there are some wounds that cannot be wholly cured",
    "I fear it may be so with mine",
    "How is Harry?",
    "Gone",
    "Good evening to you!",
    "Do you think you killed him with that apple, Sam?",
    "That is just what we should like, too",
    "Southlinch",
    "No one comes nigh Bree now from Outside",
    "I will indeed",
    "How many?",
    "Three and two",
    "Well, no one troubled us",
    "Well, well",
    "How long will that be?",
    "I expect it has",
    "You will be let alone, Barliman",
    "The Rangers go there",
    "He will",
    "He knows it and loves it.",
    "Does he now?",
    "Ah!",
    "But he says your beer is always good.",
    "He says?",
    "Strider!",
    "Him with a crown and all and a golden cup! Well, what are we coming to?",
    "Better times, for Bree at any rate",
    "Nob, you slowcoach!",
    "Now!",
    "Now what does that remind me of?",
    "What! My Bill?",
    "Not yet",
    "I am going home now to put my notes in order.",
    "I wonder what old Barliman was hinting at",
    "I can guess some of it",
    "Whatever it is",
    "Deep in, but not at the bottom",
    "I am with you at present",
    "Well here we are, just the four of us that started out together",
    "Not to me",
    "To me it feels more like falling asleep again.",
    "Come along!",
    "Bless me! If s Master Merry, to be sure, and all dressed up for fighting!",
    "Then stop gaping at me through the bars, and open the gate!",
    "Whose orders?",
    "The Chiefs up at Bag End.",
    "Do you indeed!",
    "We shall wake him up in a way that will surprise him",
    "Come on, Pippin!",
    "Two is enough.",
    "Bill Ferny",
    "Give me the key!",
    "Neat work, Bill",
    "So much for your Big Man",
    "Has it been a bad year, or what? I thought it had been a fine summer and harvest.",
    "Oh come!",
    "Well now, what about a smoke, while you tell us what has been happening in the Shire?",
    "Now you shut up, Hob Hayward!",
    "All right, all right!",
    "And what else?",
    "I can add some more, if you like it",
    "All right",
    "Hey, come here Robin Smallburrow!",
    "I want a word with you.",
    "You ought to be ashamed of yourself having anything to do with such nonsense",
    "But you can give it up, stop Shirriffing, if it has stopped being a respectable job",
    "If I hear not allowed much oftener",
    "Then why do you do their work far them?",
    "Who sent you to Frogmorton?",
    "Hullo, hullo!",
    "Leader!",
    "Now get on!",
    "Well, come along in your own time!",
    "We are going on.",
    "Good luck to you!",
    "Like many that I saw at Isengard",
    "Coming along nicely",
    "Garn, what did I say?",
    "And what difference would that have made, pray?",
    "We are not used to footpads in this country, but we know how to deal with them.",
    "Footpads, eh?",
    "And what may that be?",
    "This country wants waking up and setting to rights",
    "A beggar in the wilderness!",
    "I am a messenger of the King",
    "Go!",
    "If you trouble this village again, you will regret it.",
    "Miserable fool, but I am sorry for him.",
    "Save Lotho? Whatever do you mean?",
    "Destroy him I should say.",
    "Weill am staggered!",
    "Fight?",
    "But if there are many of these ruffians",
    "No",
    "No!",
    "Do what?",
    "Raise the Shire!",
    "On, lad! On!",
    "Well!",
    "Good, good!",
    "Hullo Rosie!",
    "Hullo, Sam!",
    "Perhaps not",
    "Well, be off with you!",
    "I think you look fine, Sam",
    "Go on now! But take care of yourself, and come straight back as soon as you have settled the ruffians!",
    "Have they got any weapons?",
    "There you are, Frodo!",
    "Not exactly",
    "Good for the Tooks!",
    "All the same",
    "All right!",
    "Very good",
    "You make the arrangements.",
    "Thank you!",
    "I was just going to ask you that",
    "We have met before",
    "Why not now?",
    "All right, Sam",
    "It all began with Pimple, as we call him",
    "Who is this Sharkey?",
    "I heard one of the ruffians speak of him.",
    "The Thain has raised all our country",
    "Well, you have walked into a trap",
    "All that country is alive with our hunters now.",
    "So I see",
    "Garn!",
    "You are dirty and insolent, Sandyman",
    "Save your breath!",
    "Where is that miserable Lotho hiding?",
    "Shall we turn on the others to search the sheds?",
    "This is worse than Mordor!",
    "Yes, this is Mordor",
    "No doubt, no doubt! But you did not, and so I am able to welcome you home.",
    "Sharkey!",
    "I did not",
    "Quite capable",
    "Well, if that is what you find pleasure in",
    "Kill him!",
    "Kill him, if you think there are enough of you, my brave hobbits!",
    "Worm! Worm!",
    "No, Sam!",
    "You have grown, Halfling",
    "Wormtongue!",
    "No evil?",
    "No, no!",
    "Then I will",
    "And the very last end of the War, I hope",
    "I hope so",
    "You would have done better to come with us after all, poor old Fredegar!",
    "I wondered when you would think of it",
    "Open it!",
    "Throw it in the air on a breezy day and let it do its work!",
    "On what?",
    "Choose one spot as a nursery, and see what happens to the plants there",
    "Use all the wits and knowledge you have of your own, Sam",
    "It is gone for ever",
    "When are you going to move in and join me, Sam?",
    "But you know the Gaffer is close at hand, and he will be very well looked after by Widow Rumble.",
    "Well, what is it?",
    "I see",
    "I am wounded",
    "Well, Sam",
    "So he will!",
    "Well, Sam",
    "Poor Sam! It will feel like that, I am afraid",
    "Well, you have kept at it, I must say.",
    "I have quite finished, Sam",
    "The last pages are for you.",
    "It seems like a dream now.",
    "Well, Master Samwise",
    "Hullo, Frodo!",
    "Yes, I am coming",
    "Where are you going, Master?",
    "To the Havens, Sam",
    "But",
    "Come now, ride with me!",
    "You tried to give us the slip once before and failed, Frodo.",
    "Yes",
    "I read the signs aright",
    "The horn of Boromir!",
    "He is in need!",
    "No!",
    "Which way did they go? Was Frodo there?",
    "Alas!",
    "Alas!",
    "Boromir is dead",
    "The hobbits!",
    "Where are they then? Where is Frodo?",
    "I do not know",
    "First we must tend the fallen",
    "We cannot leave him lying like carrion among these foul Orcs.",
    "But we must be swift",
    "Are we to abandon him? Must we not seek him first? An evil choice is now before us!",
    "Then let us do first what we must do",
    "Then let us lay him in a boat with his weapons, and the weapons of his vanquished foes",
    "See!",
    "Here we find tokens!",
    "And I",
    "I have not seen these tokens before",
    "S is for Sauron",
    "Nay!",
    "Neither does he use his right name, nor permit it to be spelt or spoken",
    "S is for Saruman, I guess",
    "Well, we have no time to ponder riddles",
    "Let us bear Boromir away!",
    "But after that we must guess the riddles, if we are to choose our course rightly",
    "Maybe there is no right choice",
    "Have Orcs been there?",
    "We saw no signs of them",
    "And Orcs would have taken or destroyed all the boats, and the baggage as well.",
    "I will look at the ground when we come there",
    "They will look for him from the White Tower",
    "What news from the West, O wandering wind, do you bring to me tonight? Have you seen Boromir the Tall by moon or by starlight?",
    "You left the East Wind to me",
    "There are some clear prints here",
    "How then do you read this riddle?",
    "Two packs are missing.",
    "But why should he leave us behind, and without a word?",
    "That was a strange deed!",
    "And a brave deed",
    "Maybe hunting Orcs came on him and he fled",
    "He fled, certainly",
    "Well, so much at least is now clear",
    "Our choice then",
    "Let me think!",
    "And now may I make a right choice and change the evil fate of this unhappy day!",
    "I will follow the Orcs",
    "No other folk make such a trampling",
    "It seems their delight to slash and beat down growing things that are not even in their way.",
    "But they go with a great speed for all that",
    "Well, after them!",
    "Yes",
    "Northward to take a straighter road to Isengard, or Fangorn, if that is their aim as you guess? Or southward to strike the Entwash?",
    "We have already overtaken some of those that we are hunting",
    "Eook!",
    "Here is another riddle!",
    "But it needs the light of day and for that we cannot wait.",
    "Yet however you read it, it seems not unhopeful",
    "No",
    "What do you think?",
    "I think that the enemy brought his own enemy with him",
    "Or about the captives",
    "Let us hope that they, too, did not meet their end here.",
    "At last!",
    "Gondor! Gondor!",
    "Look!",
    "No, not even my eyes can see him, my good Legolas",
    "Many things",
    "I think, nonetheless, that we no longer need any trail to tell us which way to go",
    "Let us find a path down to the fields as quick as may be.",
    "I doubt if you will find a path quicker than the one that the Orcs chose",
    "Ah! the green smell!",
    "Light feet may run swiftly here",
    "Stay!",
    "Do not follow me yet!",
    "Yes",
    "Not idly do the leaves of Lurien fall",
    "Then he at least was alive",
    "Come! Let us go on! The thought of those merry young folk driven like cattle burns my heart.",
    "We have come at last to a hard choice",
    "Shall we rest by night, or shall we go on while our will and strength hold?",
    "Unless our enemies rest also, they will leave us far behind, if we stay to sleep.",
    "Surely even Orcs must pause on the march?",
    "Certainly they will not rest by night.",
    "But if we walk by night, we cannot follow their trail",
    "The trail is straight, and turns neither right nor left, as far as my eyes can see",
    "Maybe, I could lead you at guess in the darkness and hold to the line",
    "And there is this also",
    "That is true",
    "Yet it would be rash to be sure of their counsels",
    "And what of escape? In the dark we should have passed the signs that led you to the brooch.",
    "The Orcs will be doubly on their guard since then, and the prisoners even wearier",
    "I said that it was a hard choice",
    "How shall we end this debate?",
    "You are our guide",
    "My heart bids me go on",
    "You give the choice to an ill chooser",
    "Since we passed through the Argonath my choices have gone amiss.",
    "We will not walk in the dark",
    "And tonight he is shrouded anyway",
    "Would that the Lady had given us a light, such a gift as she gave to Frodo!",
    "It will be more needed where it is bestowed",
    "They are far far away",
    "Nonetheless we will still follow as we may",
    "Come! We must go",
    "The scent is growing cold.",
    "But it is still dark",
    "I fear they have passed beyond my sight from hill or plain, under moon or sun",
    "Where sight fails the earth may bring us rumour",
    "The land must groan under their hated feet.",
    "The rumour of the earth is dim and confused",
    "Let us go!",
    "This is a bitter end to our hope and to all our toil!",
    "To hope, maybe, but not to toil",
    "Truly!",
    "Saruman!",
    "Awake! Awake!",
    "I can see nothing away north or west but grass dwindling into mist",
    "Could we see the forest, if we climbed the hills?",
    "It is still far away",
    "Well, let us go on",
    "Let us go up on to this green hill!",
    "Nothing can we see to guide us here",
    "The wind is north from the snows",
    "And ere morning it will be in the East",
    "Riders!",
    "Many riders on swift steeds are coming towards us!",
    "Yes",
    "Keen are the eyes of the Elves",
    "Nay! The riders are little more than five leagues distant",
    "Five leagues or one",
    "We will wait",
    "Or spears",
    "There are three empty saddles, but I see no hobbits",
    "I did not say that we should hear good news",
    "But evil or good we will await it here.",
    "What do you know of these horsemen, Aragorn?",
    "Do we sit here waiting for sudden death?",
    "I have been among them",
    "I believe it no more than did Boromir",
    "You will soon learn the truth",
    "Already they approach.",
    "What news from the North, Riders of Rohan?",
    "Who are you, and what are you doing in this land?",
    "I am called Strider",
    "At first I thought that you yourselves were Orcs",
    "No",
    "Then there is a Lady in the Golden Wood, as old tales tell!",
    "Why do you not speak, silent ones?",
    "As for that",
    "He stands not alone",
    "You would die before your stroke fell.",
    "Your pardon, Jomer!",
    "I will",
    "First tell me whom you serve",
    "Are you friend or foe of Sauron, the Dark Lord of Mordor?",
    "I serve only the Lord of the Mark, Thjoden King son of Thengel",
    "I serve no man",
    "Elendil!",
    "The doom of choice",
    "That you need not pursue them further",
    "The Orcs are destroyed.",
    "And our friends?",
    "We found none but Orcs.",
    "But that is strange indeed",
    "There were no dwarves nor children",
    "We do not speak of dwarves or children",
    "Our friends were hobbits.",
    "Hobbits?",
    "And what may they be? It is a strange name.",
    "A strange name for a strange folk",
    "Halflings!",
    "A man may do both",
    "Peace, Jothain!",
    "All that you say is strange, Aragorn.",
    "I set out from Imladris, as it is named in the rhyme, many weeks ago",
    "Gandalf !",
    "That is heavy tidings",
    "It is tidings more grievous than any in this land can understand, though it may touch them sorely ere the year is much older",
    "Your news is all of woe!",
    "It is now the fourth day since he was slain",
    "On foot?",
    "Yes, even as you see us.",
    "Strider is too poor a name, son of Arathorn",
    "We do not and we never have.",
    "I will come when I may",
    "Come now!",
    "I thank you for your fair words",
    "Hope does not remain",
    "Then what do you think has become of them?",
    "I would swear that no Ore escaped after we sighted them",
    "Our friends were attired even as we are",
    "I had forgotten that",
    "As he ever has judged",
    "True indeed",
    "We both have need of haste",
    "I will not",
    "It may be well enough for this lord of the race of Gondor, as he claims",
    "No one",
    "But you must ride now, or you will hinder us",
    "Hasufel is his name",
    "May he bear you well and to better fortune than Gbrulf, his late master!",
    "I need them not",
    "Farewell, and may you find what you seek!",
    "Return with what speed you may, and let our swords hereafter shine together!",
    "I will come",
    "And I will come, too",
    "We shall see",
    "There is little to discover",
    "We can do no more",
    "But Gandalf was not",
    "His foresight failed him.",
    "The counsel of Gandalf was not founded on foreknowledge of safety, for himself or for others",
    "Let us light a fire",
    "If those unhappy hobbits are astray in the woods, it might draw them hither",
    "And it might draw other things, neither Ore nor Hobbit",
    "But the Rohirrim made a great burning here yesterday",
    "They were many",
    "There is no need",
    "The Riders have left chip and bough enough, and there is dead wood lying in plenty.",
    "Look!",
    "The tree is glad of the fire!",
    "Celeborn warned us not to go far into Fangorn",
    "Do you know why, Aragorn? What are the fables of the forest that Boromir had heard?",
    "I have heard many tales in Gondor and elsewhere",
    "Yes, it is old",
    "And I do not wish to know",
    "Let nothing that dwells in Fangorn be troubled on my account!",
    "Gimli!",
    "Well, father, what can we do for you?",
    "Come and be warm, if you are cold!",
    "The horses! The horses!",
    "Well, they are gone",
    "Feet!",
    "Only a few hours ago you were unwilling to sit on a horse of Rohan",
    "You will make a rider yet.",
    "It seems unlikely that I shall have the chance",
    "If you wish to know what I think",
    "I mark them",
    "I suppose I was knocked on the head",
    "I wish Gandalf had never persuaded Elrond to let us come",
    "Rest while you can, little fool!",
    "No time for play on this trip.",
    "Orders.",
    "What are they wanted for?",
    "Why alive? Do they give good sport?",
    "That is a very interesting remark",
    "And mine too",
    "Not our orders!",
    "Then you can wish again",
    "Is Saruman the master or the Great Eye?",
    "If we could cross the Great River, we might",
    "But there are not enough of us to venture down to the bridges.",
    "I came across",
    "Aye, we must stick together",
    "You have spoken more than enough, UgKDk",
    "Put up your weapons!",
    "Now",
    "Pick up those prisoners!",
    "The scouts have come back at last",
    "Well, what did you discover?",
    "Sit up!",
    "Now for the other!",
    "Hullo, Pippin!",
    "Now then!",
    "Now straight on!",
    "But what are we going to do at sunrise?",
    "Go on running",
    "What do you think? Sit on the grass and wait for the Whiteskins to join the picnic?",
    "Ai! Steady now!",
    "Halt!",
    "No hope of escape!",
    "But there is a hope that I have left some of my own marks unspoilt on the wet ground.",
    "There I suppose it will lie until the end of time",
    "Enough!",
    "Very well",
    "I know",
    "Thought better of it, eh?",
    "Indeed!",
    "I left a fool",
    "Splendid!",
    "Nazgyl, Nazgyl",
    "You seem to know a lot",
    "Maggots!",
    "But how will they know that we are not Orcs?",
    "Well, here we are",
    "Lembas!",
    "Yes, I had a packet in my pocket",
    "I daresay you would",
    "Well, my little ones!",
    "Nothing, my precious",
    "O ho!",
    "Do I want it? Do I want it?",
    "What would I give for it? What do you mean?",
    "We mean",
    "My dear tender little fools",
    "I find it quite easy to believe",
    "Gollum, go llum!",
    "Untie our legs!",
    "Curse you, you filthy little vermin!",
    "Now",
    "No need to try",
    "We must be off",
    "Half a moment!",
    "Now for it!",
    "We must get under cover",
    "Yes",
    "Not here, the banks are too steep",
    "Forward now!",
    "You seem to have been doing well, Master Took",
    "Lead on, Master Brandybuck!",
    "I have not",
    "We have watched too long",
    "I want some air.",
    "We can at least follow the course of this stream, the Entwash or whatever you call it, and get out again the way we came.",
    "We could, if our legs would do it",
    "Yes, it is all very dim, and stuffy, in here",
    "But the Sun at any rate must peep in sometimes.",
    "No, nor hobbits",
    "Low",
    "We ran off with nothing but a couple of spare packets of lembas, and left everything else behind.",
    "And not a wrap or a blanket",
    "We shall be cold tonight, whichever way we go.",
    "The morning must be getting on.",
    "Hullo!",
    "Up we go!",
    "Now for a breath of air, and a sight of the land!",
    "Yes",
    "Hrum, Hoorn",
    "Please.",
    "Hrum, now",
    "Hoo now!",
    "We always seem to have got left out of the old lists, and the old stories",
    "Why not make a new line?",
    "Hm! Not bad, not bad",
    "Hm, but you are hasty folk, I see",
    "But now",
    "There is quite a lot going on",
    "Do you know him?",
    "Yes",
    "Then I can answer your other questions",
    "Yes, we do",
    "The story seems to be going on, but I am afraid Gandalf has fallen out of it.",
    "Hoo, come now!",
    "Hoorn, hm, ah well.",
    "Hill?",
    "Shelf? Step?",
    "Where shall we go?",
    "To my home, or one of my homes",
    "Is it far?",
    "Well, you see, we have lost all our belongings",
    "We have only a little food.",
    "O! Hm! You need not trouble about that",
    "They are falling rather behind the world in there, I guess",
    "What do you mean?",
    "What is true?",
    "The trees and the Ents",
    "Like the Old Forest away to the north, do you mean?",
    "Hm! Here we are!",
    "Well, well, now we can talk again",
    "Now tell me your tale, and do not hurry!",
    "You never see any, hm, any Ents round there do you?",
    "Well, not Ents, Entwives I should really say.",
    "Are they like you at all?",
    "But they would like your country, so I just wondered.",
    "Hm, hoom!",
    "And what about yourself?",
    "Hoom, hm, I have not troubled about the Great Wars",
    "Do you know anything about his history?",
    "Saruman is a Wizard",
    "Some time ago I began to wonder how Orcs dared to pass through my woods so freely",
    "I will stop it!",
    "We will come with you",
    "We will do what we can.",
    "Yes!",
    "Good! Good!",
    "Fangorn, Finglas, Fladrif, aye, aye",
    "The trouble is that there are so few of us left",
    "Why are there so few when you have lived in this country so long?",
    "Have a great many died?",
    "Oh, no!",
    "How very sad!",
    "How was it that they all died?",
    "Well, I am afraid the songs have not come west over the Mountains to the Shire",
    "Yes, I will indeed",
    "It is rather a strange and sad story",
    "That is how it goes",
    "We usually lie down to sleep",
    "We shall be all right where we are.",
    "Lie down to sleep!",
    "Hoo, ho! Good morning, Merry and Pippin!",
    "Where is Entmoot?",
    "Hoo, eh? Entmoot?",
    "I wonder what the Entish is for yes or no",
    "Hm, ha, hey, my Pippin!",
    "I wonder where Isengard is?",
    "What is Isengard like?",
    "I wonder what Ents can do about it anyway.",
    "So do I",
    "Yes!",
    "Hm, hoom, here I am again",
    "Ha, hmm, my friends, let us go for a walk!",
    "Hoom, hom! Here we come with a boom, here we come at last!",
    "To Isengard!",
    "Quickly?",
    "Will you really break the doors of Isengard?",
    "Of course, it is likely enough, my friends",
    "Night lies over Isengard",
    "My very bones are chilled",
    "And do not forget that old man!",
    "I should be happier if I could see the print of a boot.",
    "Why would that make you happy?",
    "Because an old man with feet that leave marks might be no more than he seemed",
    "Maybe",
    "That would not baffle a Ranger",
    "It is likely enough",
    "No",
    "So I thought",
    "Here at last we find news!",
    "And here is the knife that cut them!",
    "Well, here is the strangest riddle that we have yet found!",
    "There was sorcery here right enough",
    "Maybe, I could",
    "And how do you suppose that either of our friends came to have a hand free?",
    "I do not know how it happened",
    "Then let us go to the forest",
    "Then we must go in, too",
    "I do not think the wood feels evil, whatever tales may say",
    "Well, it has no cause to be angry with me",
    "That is just as well",
    "I feel the air is stuffy",
    "This wood is lighter than Mirkwood, but it is musty and shabby.",
    "It is old, very old",
    "I dare say you could",
    "If that is indeed all we can do, then we must do that",
    "Let us go on.",
    "Let us go up and look about us!",
    "I am almost sure that the hobbits have been up here",
    "We have journeyed a long way round",
    "But we did not wish to come to Fangorn",
    "Look!",
    "Look at what?",
    "There in the trees.",
    "Hush! Speak more softly! Look!",
    "I see, I see now!",
    "Why are you waiting? What is the matter with you?",
    "Legolas is right",
    "Well met indeed, my friends",
    "Now!",
    "Stop him, Legolas!",
    "Did I not say that I wished to speak to you?",
    "Put away that bow, Master Elf!",
    "Well met, I say again!",
    "You speak as one that knows Fangorn well",
    "Is that so?",
    "Not well",
    "Might we know your name, and then hear what it is that you have to say to us?",
    "The morning passes, and we have an errand that will not wait.",
    "My name!",
    "There are some who would begin to doubt whether your errand is fit to tell",
    "Saruman!",
    "Mithrandir!",
    "Mithrandir!",
    "Gandalf!",
    "Beyond all hope you return to us in our need! What veil was over my sight? Gandalf!",
    "Gandalf",
    "Yes, you may still call me Gandalf",
    "Gandalf!",
    "But you are all in white!",
    "Yes, I am white now",
    "What do you wish to know?",
    "No, I did not find them",
    "There was a darkness over the valleys of the Emyn Muil, and I did not know of their captivity, until the eagle told me.",
    "The eagle!",
    "Yes",
    "Then you know about Frodo!",
    "How do things go with him?",
    "Not alone",
    "We think that Sam went with him.",
    "Did he!",
    "You have not said all that you know or guess, Aragorn my friend",
    "In one thing you have not changed, dear friend",
    "What? In riddles?",
    "I am no longer young even in the reckoning of Men of the Ancient Houses",
    "Will you not open your mind more clearly to me?",
    "What then shall I say?",
    "Then is not Saruman a traitor?",
    "Indeed yes",
    "It is a pity that our friends lie in between",
    "If no land divided Isengard and Mordor, then they could fight while we watched and waited.",
    "The victor would emerge stronger than either, and free from doubt",
    "The Winged Messenger!",
    "One that you cannot slay with arrows",
    "Now you speak to yourself again",
    "Wait a minute!",
    "You certainly did not see me",
    "Good, good!",
    "I am glad that it was not you.",
    "Yes, my good Dwarf",
    "But the hobbits!",
    "With Treebeard and the Ents",
    "The Ents!",
    "Then there is truth in the old legends about the dwellers in the deep forests and the giant shepherds of the trees? Are there still Ents in the world? I thought they were only a memory of ancient days, if indeed they were ever more than a legend of Rohan.",
    "A legend of Rohan!",
    "Ah! now you are asking much",
    "Perhaps he also thought that you were Saruman",
    "Dangerous!",
    "I do not know",
    "The morning is wearing away",
    "Soon we must go.",
    "Do we go to find our friends and to see Treebeard?",
    "No",
    "No",
    "Come, Aragorn son of Arathorn!",
    "Then are we not to see the merry young hobbits again?",
    "I did not say so",
    "It is a long way for a man to walk, young or old",
    "We shall see, we shall see",
    "Will you come now with me?",
    "Yes, we will set out together",
    "But I do not doubt that you will come there before me, if you wish.",
    "Do I not say truly, Gandalf",
    "Yes, together we will follow you",
    "I have stayed already too long",
    "Then tell us what you will, and time allows!",
    "Come, Gandalf, tell us how you fared with the Balrog!",
    "Name him not!",
    "Long time I fell",
    "Yet it has a bottom, beyond light and knowledge",
    "Long has that been lost",
    "Many have said that it was never made save in legend, but others say that it was destroyed.",
    "It was made, and it had not been destroyed",
    "A burden you have been",
    "Do not let me fall!",
    "Bear me to Lothlurien!",
    "That indeed is the command of the Lady Galadriel who sent me to look for you",
    "Then she sent me no message?",
    "Dark are her words",
    "That is no comfort",
    "What then?",
    "Would you have her speak openly to you of your death?",
    "What is that?",
    "It will be a weary walk!",
    "There is more than one horse coming",
    "We are too great a burden for one.",
    "There are three",
    "Nor will you again",
    "It is a long way from Rivendell, my friend",
    "We go at once to Meduseld, the hall of your master, Thjoden",
    "Yes, I knew",
    "He is steering a straight course now for the halls of Thjoden under the slopes of the White Mountains",
    "I see a great smoke",
    "What may that be?",
    "Battle and war!",
    "Ride on!",
    "Look!",
    "Tell us what you see there before us!",
    "I see a white stream that comes down from the snows",
    "It runs thus in the Common Speech",
    "Stay, strangers here unknown!",
    "Well do I understand your speech",
    "It is the will of Thjoden King that none should enter his gates, save those who know our tongue and are our friends",
    "We are no phantoms",
    "Of Jomer I have naught to say",
    "Wormtongue?",
    "Yes, I will go",
    "Well do you see and speak",
    "No man will touch them I promise you",
    "It is not my will",
    "It is the will of Thjoden",
    "This is the house of Thjoden, not of Aragorn, even were he King of Gondor in the seat of Denethor",
    "This is idle talk",
    "Truly",
    "Whatever its name may be",
    "Not alone!",
    "Not alone!",
    "Come, come!",
    "Here I set it",
    "Well",
    "Behold Eorl the Young!",
    "Thus he rode out of the North to the Battle of the Field of Celebrant.",
    "I greet you",
    "You speak justly, lord",
    "Did I not counsel you, lord, to forbid his staff? That fool, Hbma, has betrayed us!",
    "Now Thjoden son of Thengel, will you hearken to me?",
    "Do you ask for help?",
    "Open!",
    "The Lord of the Mark comes forth!",
    "Send your guards down to the stairs foot",
    "The time for fear is past.",
    "Now, lord",
    "It is not so dark here",
    "No",
    "Dark have been my dreams of late",
    "Much",
    "It is true",
    "He had rebelled against my commands, and threatened death to Grnma in my hall.",
    "There is no time to tell all that you should hear",
    "Verily",
    "Alas!",
    "Where has Grnma stowed it?",
    "Take this, dear lord!",
    "It was ever at your service.",
    "How comes this?",
    "It is my doing, lord",
    "To lay at your feet, my lord",
    "Will you not take the sword?",
    "Westu Thjoden hbl!",
    "You have yourself already taken it",
    "This counsel seems good to me now",
    "Nay, lord",
    "Now indeed there is hope of victory!",
    "Hope, yes",
    "Nay, Gandalf!",
    "Then even the defeat of Rohan will be glorious in song",
    "The Lord of the Mark will ride! Forth Eorlingas!",
    "Who shall guide them and govern them in your place?",
    "I will take thought for that ere I go",
    "Here comes my counsellor.",
    "Here, lord, is Herugrim, your ancient blade",
    "You lie",
    "And this sword your master himself gave into my keeping.",
    "And he now requires it of you again",
    "Does that displease you?",
    "I will",
    "Dear lord!",
    "If this is bewitchment",
    "Mercy, lord!",
    "You have my pity",
    "Such a resolve might be expected from a lord of the House of Eorl, old though he be",
    "And if that plea does not excuse you from war, most noble Wormtongue",
    "Nay, Jomer, you do not fully understand the mind of Master Wormtongue",
    "Down snake!",
    "Down on your belly! How long is it since Saruman bought you? What was the promised price? When all the men were dead, you were to pick your share of the treasure, and take the woman you desire? Too long have you watched her under your eyelids and haunted her steps.",
    "That I knew already",
    "Jowyn is safe now",
    "You lie",
    "That word comes too oft and easy from your lips",
    "Do you hear this, Wormtongue?",
    "After him!",
    "And if any will bear him",
    "Now my guests, come!",
    "Come and take such refreshment as haste allows.",
    "How far back his treachery goes, who can guess?",
    "I owe much to Jomer",
    "Faithful heart may have forward tongue.",
    "Say also",
    "Indeed my eyes were almost blind",
    "Whether I came in time or not is yet to be seen",
    "You choose well",
    "May it keep you well!",
    "I am proud, Lord of the Mark, to bear your device",
    "It may well be so",
    "Ferthu Thjoden hbl!",
    "Hail Aragorn son of Arathorn!",
    "Hail Lady of Rohan!",
    "Behold! I go forth, and it seems like to be my last riding",
    "Is there none whom you would name? In whom do my people trust?",
    "In the House of Eorl",
    "But Jomer I cannot spare, nor would he stay",
    "I said not Jomer",
    "It shall be so",
    "Let the heralds announce to the folk that the Lady Jowyn will lead them!",
    "Speak not so!",
    "A year shall I endure for every day that passes until your return.",
    "The king shall come again",
    "Lear not! Not West but East does our doom await us.",
    "Well, at last we set off!",
    "A safer seat than many, I guess",
    "I thank you indeed",
    "I will gladly go with you, if Legolas, my comrade, may ride beside us.",
    "It shall he so",
    "Legolas upon my left, and Aragorn upon my right, and none will dare to stand before us!",
    "Where is Shadowfax?",
    "Running wild over the grass",
    "Were the breath of the West Wind to take a body visible, even so would it appear",
    "The gift seems already to be given",
    "I thank you, Thjoden King",
    "Behold the White Rider!",
    "Our King and the White Rider!",
    "Forth Eorlingas!",
    "And behind us comes a very storm of Mordor",
    "It will be a black night.",
    "Is Jomer here?",
    "Come, stand before me, Ceorl!",
    "Command me, lord!",
    "Give this man a fresh horse! Let us ride to the help of Erkenbrand!",
    "Ride, Thjoden!",
    "What does that mean?",
    "That Gandalf Greyhame has need of haste",
    "True enough",
    "Maybe you will wait long",
    "We have found many of our folk lying slain as they fled thither",
    "Has aught been seen of Gandalf?",
    "It is very great",
    "He that flies counts every foeman twice, yet I have spoken to stouthearted men, and I do not doubt that the main strength of the enemy is many times as great as all that we have here.",
    "Then let us be swift",
    "It will not be long I fear",
    "It is a great host and follows us hard",
    "They bring fire",
    "Would that day was here and we might ride down upon them like a storm out of the mountains!",
    "It grieves me to fly before them.",
    "We need not fly much further",
    "Nay, we are too few to defend the Dike",
    "It is a mile long or more, and the breach in it is wide.",
    "At the breach our rearguard must stand, if we are pressed",
    "I, Jomer son of Jomund, speak.",
    "Hasten! The enemy is on your heels.",
    "Maybe, we have a thousand fit to fight on foot",
    "I fear that he will not come now",
    "Our scouts have gained no news of him, and the enemy fills all the valley behind us.",
    "I would that he had escaped",
    "Behind us in the caves of the Deep are three parts of the folk of Westfold, old and young, children and women",
    "But great store of food, and many beasts and their fodder, have also been gathered there.",
    "That is well",
    "They are burning or despoiling all that is left in the vale.",
    "It is dark for archery",
    "The enemy is at hand!",
    "Come!",
    "This is the hour when we draw swords together!",
    "We did not come too soon",
    "Yet we cannot stay here beyond the walls to defend them",
    "Look!",
    "Khazvd! Khazvd!",
    "The Orcs are in the Deep!",
    "Now my count passes Master Legolas again.",
    "But I will help as I may.",
    "It will be drier above",
    "Come, Gamling, let us see how things go on the wall!",
    "Good!",
    "This is a night as long as years",
    "How long will the day tarry?",
    "Dawn is not far off",
    "But dawn will not help us, I fear.",
    "Yet dawn is ever the hope of men",
    "I hear them",
    "Yet there are many that cry in the Dunland tongue",
    "The king the king!",
    "Nonetheless day will bring hope to me",
    "Is it not said that no foe has ever taken the Hornburg, if men defended it?",
    "So the minstrels say",
    "Then let us defend it, and hope!",
    "Devilry of Saruman!",
    "All who can have now got safe within, Aragorn",
    "Come back!",
    "Things go ill, my friends",
    "Ill enough",
    "I do not know.",
    "I last saw him fighting on the ground behind the wall, but the enemy swept us apart.",
    "Alas! That is evil news",
    "He is stout and strong",
    "If he wins back to the caves, he will pass your count again",
    "Never did I see an axe so wielded.",
    "I must go and seek some arrows",
    "Would that this night would end, and I could have better light for shooting.",
    "Nay, he did not come to the Rock",
    "What is the news, Aragorn?",
    "Is Jomer here?",
    "But the Orcs have brought a devilry from Orthanc",
    "I fret in this prison",
    "Here at least you are guarded in the strongest fastness of the Mark",
    "More hope we have to defend you in the Hornburg than in Edoras, or even at Dunharrow in the mountains.",
    "It is said that the Hornburg has never fallen to assault",
    "Do not judge the counsel of Gandalf, until all is over, lord",
    "The end will not be long",
    "I will ride with you",
    "Come down! Come down!",
    "The king stays or comes at his own will",
    "Then what are you doing here?",
    "I looked out to see the dawn",
    "What of the dawn?",
    "None knows what the new day shall bring him",
    "Get you gone, ere it turn to your evil.",
    "Get down or we will shoot you from the wall",
    "I have still this to say",
    "Helm! Helm!",
    "Forth Eorlingas!",
    "Erkenbrand!",
    "Erkenbrand!",
    "Behold the White Rider!",
    "Gandalf is come again!",
    "Mithrandir, Mithrandir!",
    "This is wizardry indeed! Come! I would look on this forest, ere the spell changes.",
    "You have passed my score by one",
    "But I do not grudge you the game, so glad am I to see you on your legs!",
    "Now that I see you safe, I am glad indeed.",
    "Hail, Lord of the Mark!",
    "I said that I would return and meet you here.",
    "Then if not yours, whose is the wizardry?",
    "It is not wizardry, but a power far older",
    "And what may be the answer to your riddle?",
    "To Isengard?",
    "Yes",
    "But there are not men enough in the Mark, not if they were all gathered together and healed of wounds and weariness, to assault the stronghold of Saruman",
    "Nevertheless to Isengard I go",
    "Nay!",
    "I wish to speak with Saruman, as soon as may be now",
    "My men are weary with battle",
    "Then let all who are to ride with me rest now",
    "I will tend it, while you rest",
    "Help now to repair the evil in which you have joined",
    "Let the Orcs lie",
    "Great injury indeed has Saruman done to me and all this land",
    "It is hot in here",
    "Then I will wish you this fortune for your comfort, Gimli",
    "No, you do not understand",
    "You move me, Gimli",
    "That would not be the way of return that I should choose",
    "But I will endure Fangorn, if I have your promise to come back to the caves and share their wonder with me.",
    "You have my promise",
    "About fifteen leagues, as the crows of Saruman make it.",
    "And when we come there, what shall we see?",
    "You may know, but I cannot guess.",
    "I do not know myself for certain",
    "There are eyes!",
    "Eyes looking out from the shadows of the boughs! I never saw such eyes before.",
    "No, no!",
    "Do as you please in your madness, but let me first get down from this horse! I wish to see no eyes!",
    "Stay, Legolas Greenleaf!",
    "Do not go back into the wood, not yet! Now is not your time.",
    "You need no weapons",
    "Herdsmen!",
    "Where are their flocks? What are they, Gandalf? For it is plain that to you, at any rate, they are not strange.",
    "They are the shepherds of the trees",
    "Ents!",
    "You should be glad, Thjoden King",
    "Yet also I should be sad",
    "It may",
    "This is become a dreary place",
    "So it would seem",
    "Alas!",
    "Look!",
    "Here let them rest!",
    "And when their spears have rotted and rusted, long still may their mound stand and guard the Fords of Isen!",
    "Is this your work also, Gandalf, my friend?",
    "You accomplished much in an evening and a night!",
    "And glad shall I be to see it again",
    "There is ever a fume above that valley in these days",
    "Maybe he is",
    "Stay where you are!",
    "Draw no weapons! Wait! and it will pass you by!",
    "Welcome, my lords, to Isengard!",
    "Doubtless he would!",
    "And was it Saruman that ordered you to guard his damaged doors, and watch for the arrival of guests, when your attention could be spared from plate and bottle?",
    "No, good sir, the matter escaped him",
    "And what about your companions? What about Legolas and me?",
    "You speak for me, Gimli",
    "Though I would sooner learn how they came by the wine.",
    "I cannot believe that!",
    "It cannot be doubted that we witness the meeting of dear friends",
    "Hobbits, if you please, lord",
    "Hobbits?",
    "And here is another marvel! I have wandered in many lands, since I left my home, and never till now have I found people that knew any story concerning hobbits.",
    "My people came out of the North long ago",
    "It could indeed, lord",
    "For one thing",
    "I had not heard that they spouted smoke from their mouths.",
    "That is not surprising",
    "You do not know your danger, Thjoden",
    "And is Orthanc then left unguarded?",
    "There is the water",
    "Yes, a tall grey Ent is there",
    "It is past noon",
    "He left a message",
    "That is better!",
    "I will come with you",
    "So that is the King of Rohan!",
    "Well, well! The hunt is over, and we meet again at last, where none of us ever thought to come",
    "And now that the great ones have gone to discuss high matters",
    "We have learnt a few things through Treebeard, the Old Ent, but that is not nearly enough.",
    "All in good time",
    "We were the hunters, and you should give an account of yourselves to us first.",
    "Or second",
    "Then you shall have it",
    "Less than an eye!",
    "But that is another story, which can wait until after lunch.",
    "Well let us go and have lunch then!",
    "I lit a bit of fire",
    "He has not",
    "You have drunk of the waters of the Ents, have you?",
    "Many strange tales have been told about that land",
    "Ents",
    "Oh, well",
    "Now, now!",
    "You shall have it, if there is time",
    "We have heaps of it",
    "It feels good, and it smells good",
    "It is good!",
    "It would",
    "No, I am afraid not",
    "Half a moment!",
    "Does that settle the score between us?",
    "Settle it!",
    "Most noble hobbit, it leaves me deep in your debt.",
    "Well, I am going back into the open air, to see what the wind and sky are doing!",
    "We will come with you",
    "Now let us take our ease here for a little!",
    "Look!",
    "Strider the Ranger has come back!",
    "He has never been away",
    "Come now!",
    "Let me see, what is today?",
    "Only nine days ago!",
    "Here are some treasures that you let fall",
    "You will be glad to have them back.",
    "Well!",
    "And here also is your brooch, Pippin",
    "I have kept it safe, for it is a very precious thing.",
    "I know",
    "Nothing else",
    "The cutting of the bands on your wrists, that was smart work!",
    "And set us a pretty riddle",
    "I wondered if you had grown wings!",
    "Unfortunately not",
    "But you did not know about Grishnbkh.",
    "Yes, whichever side wins, his outlook is poor",
    "Things began to go all wrong for him from the moment his Orcs set foot in Rohan.",
    "We caught a glimpse of the old villain, or so Gandalf hints",
    "On the edge of the Forest.",
    "When was that?",
    "Five nights ago",
    "Let me see",
    "If Saruman had heard it, he would be a hundred miles away by now, even if he had had to run on his own legs",
    "We came down over the last ridge into Nan Curunnr, after night had fallen",
    "I thought of him too",
    "Well, of all sorts together, there must have been ten thousand at the very least",
    "My business is with Isengard tonight, with rock and stone.",
    "No",
    "The Ents are safe",
    "Gandalf!",
    "We saw a cloud of smoke and steam from the south last night when we came to the mouth of Nan Curunnr",
    "We feared that Saruman was brewing some new devilry for us.",
    "Not he!",
    "There is one thing I wonder about",
    "Oh yes, I forgot about him",
    "I have just come round to see how you are faring, my lads",
    "He was",
    "We understand it all perfectly now",
    "All except one thing",
    "Yes",
    "Yet I think I shall mention it to Gandalf, small matter though it may seem among his great affairs.",
    "I wonder what he is doing",
    "Let us go and meet them!",
    "Walk warily!",
    "Well, Treebeard and I have had some interesting discussions, and made a few plans",
    "We have",
    "Do you indeed?",
    "I will come",
    "I wish to see him and learn if he really looks like you.",
    "And how will you learn that, Master Dwarf?",
    "The last is most likely, if you ride to his door with a light heart",
    "I will go up",
    "I have been in Orthanc and I know my peril.",
    "And I too will go up",
    "As you will",
    "Nay!",
    "Come then!",
    "Half a sticky mile from here to the gate!",
    "I wish I could slip off back to the guardroom unnoticed! What did we come for? We are not wanted.",
    "Saruman, Saruman!",
    "Saruman come forth!",
    "Who is it?",
    "What do you wish?",
    "I know that voice",
    "Go and fetch Saruman, since you have become his footman, Grnma Wormtongue!",
    "And do not waste our time!",
    "Well?",
    "Why must you disturb my rest? Will you give me no peace at all by night or day?",
    "But come now",
    "The words of this wizard stand on their heads",
    "Lord, hear me!",
    "If we speak of poisoned tongues what shall we say of yours, young serpent?",
    "We will have peace",
    "Yes, we will have peace",
    "Gibbets and crows!",
    "Or, perhaps, you have things to unsay?",
    "Unsay?",
    "Saruman, Saruman!",
    "Will I come down?",
    "The treacherous are ever distrustful",
    "That sounds well",
    "Reasons for leaving you can see from your windows.",
    "Later!",
    "Come back, Saruman!",
    "I did not give you leave to go",
    "Saruman, your staff is broken.",
    "Go!",
    "The murderous rogue!",
    "The aim was poor, maybe, because he could not make up his mind which he hated more, you or Saruman",
    "That may be so",
    "I will take care of this",
    "It is not a thing, I guess, that Saruman would have chosen to cast away.",
    "But he may have other things to cast",
    "It is the end",
    "Let us go.",
    "Well, that is done",
    "Now I must find Treebeard and tell him how things have gone.",
    "He will have guessed, surely?",
    "Were they likely to end any other way?",
    "Not likely",
    "And what if Sauron does not conquer? What will you do to him?",
    "I? Nothing!",
    "It seems that Saruman thinks so too",
    "Let us leave them!",
    "Here are three of my companions, Treebeard",
    "I have spoken of them, but you have not yet seen them.",
    "So you have come all the way from Mirkwood, my good Elf? A very great forest it used to be!",
    "And still is",
    "I hope you may have your wish, ere the hills be much older",
    "I will come, if I have the fortune",
    "Any Elf that comes with you will be welcome",
    "The friend I speak of is not an Elf",
    "Hoom, hm! Ah now",
    "Hoo! Come now!",
    "Yes, we must go, and go now",
    "Maybe I shall",
    "We will!",
    "So Saruman would not leave?",
    "No",
    "Indeed no! Ents will see to that",
    "Good!",
    "The Ents pay attention to every detail!",
    "Are we riding far tonight, Gandalf?",
    "So you heard that?",
    "Thank you!",
    "Nothing or a double helping is your way!",
    "No",
    "Work it out on your fingers!",
    "But you must know how long it is since we left Lurien.",
    "Oh, that!",
    "I mean a real bed in a bedroom.",
    "Well, Rivendell then",
    "But I could sleep anywhere tonight.",
    "You had the luck, Merry",
    "You were riding with Gandalf.",
    "Well, what of it?",
    "Did you get any news, any information out of him?",
    "Oh yes, he is!",
    "Hullo!",
    "But our whole life for months has been one long meddling in the affairs of Wizards",
    "Go to sleep!",
    "Well, what else could I say?",
    "Only some bundle of oddments, perhaps, after all",
    "You idiotic fool!",
    "It is not for you, Saruman!",
    "Peregrin Took!",
    "Come back!",
    "Gandalf!",
    "Gandalf! Forgive me!",
    "Forgive you?",
    "Tell me first what you have done!",
    "I, I took the ball and looked at it",
    "What did you see, and what did you say?",
    "Speak!",
    "I saw a dark sky, and tall battlements",
    "Look at me!",
    "All right!",
    "Peril comes in the night when least expected",
    "We have had a narrow escape!",
    "How is the hobbit, Pippin?",
    "I think all will be well now",
    "Dangerous indeed, but not to all",
    "Receive it, lord!",
    "When have I been hasty or unwary, who have waited and prepared for so many long years?",
    "Yes, there can be no doubt",
    "Strange powers have our enemies, and strange weaknesses!",
    "That many times is seen",
    "That hour is now come, I think",
    "Not yet",
    "I will keep Jomer and ten Riders",
    "As you will",
    "Nazgyl!",
    "You shall come with me this time",
    "Shadowfax shall show you his paces.",
    "Away, Shadowfax!",
    "A beautiful, restful night!",
    "How fast is he going?",
    "He is running now as fast as the swiftest horse could gallop",
    "Hobbits, I suppose, have forgotten them, even those that they ever knew.",
    "No, not all",
    "About the palantnri of the Kings of Old",
    "And what are they?",
    "No",
    "What did the Men of old use them for?",
    "I wish I had known all this before",
    "I had no notion of what I was doing.",
    "Oh yes, you had",
    "It does",
    "If all the seven stones were laid out before me now, I should shut my eyes and put my hands in my pockets.",
    "Good!",
    "That is what I hoped.",
    "Mercy!",
    "It was a Black Rider on wings, a Nazgyl",
    "It could have taken you away to the Dark Tower.",
    "But it was not coming for me, was it?",
    "Of course not",
    "See now!",
    "Where are you going then?",
    "To Minas Tirith, before the seas of war surround it.",
    "Oh! And how far is that?",
    "Leagues upon leagues",
    "Well",
    "Or another and another and another",
    "I wonder",
    "No",
    "Nor me",
    "I wish we could be rid of him for good!",
    "So do I",
    "Look!",
    "All the same",
    "I think we could manage this",
    "Climb back, I suppose",
    "Easy said",
    "Better wait till morning and more light.",
    "No! Not if I can help it",
    "Master!",
    "Rope!",
    "I should have been half drowned down there, or washed clean off",
    "What a piece of luck you had that rope!",
    "Five, ten, twenty, thirty ells, more or less",
    "It does look sort of silver in the dark",
    "Very well",
    "Well!",
    "If you can think of any way we could have both used the rope and yet brought it down with us, then you can pass on to me ninnyhammer, or any other name your Gaffer gave you",
    "Climb up and untie it and let yourself down, if you want to!",
    "It certainly came",
    "Yes",
    "We had better try a way back southwards along the line of the cliff, I think",
    "We might find some nook there, or even a cave or something.",
    "I suppose so",
    "Ssss!",
    "Careful!",
    "We hate it",
    "Let go! Gollum",
    "But that would kill us, kill us",
    "No",
    "I daresay",
    "But what he means to do is another matter.",
    "Yess, wretched we are, precious",
    "Yess, yes indeed",
    "You know that, or you guess well enough, Smjagol",
    "We guessed, yes we guessed",
    "Not for you.",
    "Gollum, gollum",
    "He will not go away or go to sleep at your command, Smjagol",
    "Then sit down",
    "Your rope might prove useful again, Sam.",
    "All we need is something to keep a hold on him",
    "It hurts us, it hurts us",
    "It hurts us.",
    "Smjagol",
    "Smjagol will swear on the Precious.",
    "To be very very good",
    "No! not on it",
    "Take the rope off, Sam!",
    "Yes, yes",
    "Wait a bit, Gollum!",
    "Smjagol promised.",
    "Here it is!",
    "Ha! ha! What does we wish?",
    "Not too well",
    "Day is near",
    "You are not wise to be glad of the Yellow Face",
    "We must take a little food",
    "Must really be asleep",
    "Smjagol is hungry",
    "Be back soon.",
    "Come back now!",
    "Hi! Come back!",
    "Hullo!",
    "I dunno",
    "About the food",
    "Worms or beetles or something slimy out of holes",
    "Better now",
    "No need, no need at all",
    "No, no birds",
    "Yes, they are all round us",
    "All right",
    "There are dead things, dead faces in the water",
    "Yes, yes",
    "But that is an age and more ago",
    "Yes, yes",
    "Three precious little Gollums in a row we shall be, if this goes on much longer",
    "Wraiths!",
    "Then take it",
    "No, not this Baggins.",
    "And time we parted, too.",
    "Curse him! I wish he was choked!",
    "To the Gate, eh?",
    "I did",
    "Smjagol",
    "I did not mean the danger that we all share",
    "On, on, on",
    "O yes, O yes, there is a third way",
    "Not nice hobbit, not sensible",
    "And did you escape out of the darkness, Smjagol? Were you not rather permitted to depart upon an errand? That at least is w hat Aragorn thought, who found you by the Dead Marshes some years ago.",
    "I ask you again",
    "The Riders are about again, up in the air",
    "No, perhaps not",
    "Were there any oliphaunts?",
    "That",
    "No, no oliphaunts",
    "I wish we had a thousand oliphaunts with Gandalf on a white one at their head",
    "Good master, wise master, nice master!",
    "Soon get more now",
    "Right!",
    "Now, Gollum",
    "Smjagol will fetch water, yes",
    "But what does the hobbit want all that water for? He has drunk, he has washed.",
    "Never you mind",
    "Too thin and drawn he is",
    "Not make the nassty red tongues",
    "Stew the rabbits!",
    "What a hobbit needs with coney",
    "Gollum!",
    "Go to sleep!",
    "You should have been resting Sam",
    "A present from Smjagol",
    "And then you must take some sleep",
    "Not Orcs",
    "Nay! Not Elves",
    "I am Faramir, Captain of Gondor",
    "And travellers we are, whatever Captain Faramir may say.",
    "Then make haste to declare yourselves and your errand",
    "I do not know where he is",
    "Boromir son of the Ford Denethor?",
    "The words are known indeed",
    "Aragorn whom I named is the bearer of the Sword that was Broken",
    "And we are the Halflings that the rhyme spoke of.",
    "That I see",
    "That is hidden",
    "Farewell!",
    "The Halflings are courteous folk, whatever else they be",
    "Farewell!",
    "But still we will not sit idle and let Him do all as He would",
    "Ware! Ware!",
    "May the Valar turn him aside! Mymak! Mymak!",
    "An Oliphaunt it was!",
    "Sleep while you may",
    "But you shall see.",
    "No, not because I choose",
    "Maybe",
    "Boromir was satisfied of that claim",
    "So!",
    "Yes, I was his friend, for my part.",
    "I would grieve indeed",
    "Dead?",
    "Do you mean that he is dead, and that you knew it? You have been trying to trap me in words, playing with me? Or are you now trying to snare me with a falsehood?",
    "I would not snare even an ore with a falsehood",
    "How then did he die, and how do you know of it? Since you say that none of the Company had reached the city when you left.",
    "As to the manner of his death, I had hoped that his friend and companion would tell me how it was.",
    "Many indeed",
    "Patience!",
    "Do you remember aught of special mark that the Lord Boromir bore with him among his gear?",
    "I remember that Boromir bore a horn",
    "You remember well, and as one who has in truth seen him",
    "Alas!",
    "No more can I say than I have said",
    "Nay, it was not so",
    "I know not",
    "From Lurien",
    "You passed through the Hidden Land",
    "No, I did not know of it",
    "Go back, Faramir, valiant Captain of Gondor, and defend your city while you may, and let me go where my doom takes me.",
    "For me there is no comfort in our speech together",
    "Now you, Frodo and Samwise, will come with me and my guards",
    "I broke off our speech together",
    "I told no lies, and of the truth all I could",
    "I do not blame you",
    "Near",
    "It does",
    "Yet always he treated Aragorn with honour.",
    "I doubt it not",
    "Had he a name?",
    "Gandalf!",
    "Alas! yes",
    "I saw him fall into the abyss.",
    "I see that there is some great tale of dread in this.",
    "Neither did the Council",
    "Here, alas! I must do you a discourtesy",
    "As you will",
    "It is to no place so fair that I shall lead you",
    "But I am glad that you will take this willingly and not by force.",
    "Blindfold these guests",
    "At least by good chance we came at the right hour to reward you for your patience",
    "Well, here is our refuge",
    "You saw and heard nothing, Anborn?",
    "Perhaps",
    "He may be all right",
    "Wake our guests",
    "Easier for me and you.",
    "No, before breakfast",
    "So we always do.",
    "No",
    "But if we are guests, we bow to our host, and after we have eaten we rise and thank him.",
    "That we do also",
    "You may soon desire to sleep",
    "Fie was the last",
    "Maybe, it would have been better had Boromir fallen there with Mithrandir",
    "No indeed, Master Samwise",
    "The Lady of Lurien! Galadriel!",
    "Then she must be lovely indeed",
    "Perilously fair.",
    "So it seems",
    "Well, Frodo, now at last we understand one another",
    "Not all is well there",
    "Good night, Captain, my lord",
    "You took the chance, sir.",
    "Ah well, sir",
    "Maybe",
    "There is nothing to fear",
    "I will",
    "Tis not a bird, whatever else it be",
    "Yes",
    "There are two answers, I think",
    "Fish",
    "Shall I not shoot, Captain? For coming unbidden to this place death is our law.",
    "Wait, Anborn",
    "No!",
    "No! Must finish fish.",
    "Why? Why not go at once? Where is the other one, the cross rude hobbit? Where is he?",
    "Away up there",
    "Come!",
    "Masster, masster!",
    "Wicked! Tricksy! False!",
    "Bring wine for the guests",
    "And bring the prisoner to me.",
    "The price is not set on the fish",
    "We are lost, lost",
    "Not very wise",
    "There are locked doors and closed windows in your mind, and dark rooms behind them",
    "Master knows",
    "Yes",
    "Very good",
    "But, Lord Faramir",
    "Then I will declare my doom",
    "It is of great worth",
    "I do take Smjagol under my protection",
    "Then I say to you",
    "This I will not have secret",
    "I will answer for him",
    "Minas Morgul",
    "I do not know clearly",
    "No",
    "It is called Cirith Ungol.",
    "Frodo, I think you do very unwisely in this",
    "No, not altogether wicked",
    "Not wholly, perhaps",
    "He would not take it",
    "No",
    "Nothing certain",
    "I would not have it so",
    "It is a hard doom and a hopeless errand",
    "May no hunger trouble you on the road",
    "I have no fitting gifts to give you at our parting",
    "Most gracious host",
    "Your guide must be blindfolded",
    "Blindfold us all three, and cover up my eyes first, and then perhaps he will see that no harm is meant.",
    "Here is the last parting of our ways",
    "Go with the good will of all good men!",
    "Hungry again already?",
    "Yes, let us go",
    "No good hiding in the dark",
    "Are we rested? Have we had beautiful sleep?",
    "Day soon",
    "Which way do we go from here?",
    "Off hunting, I suppose",
    "My pipe!",
    "Silly!",
    "No",
    "You forget the Marshes",
    "We must go that way.",
    "Look! The king has got a crown again!",
    "They cannot conquer for ever!",
    "We must go",
    "I must rest a while, Sam",
    "Not yet",
    "All right",
    "I will try.",
    "The storm has burst at last",
    "Your breakfast is ready",
    "Yes, yess, longer",
    "We shall see",
    "So this secret way of yours is guarded after all",
    "All ways are watched, yes",
    "Perhaps",
    "Yes, they drink",
    "Then all the more need to fill our bottles",
    "No water flowing out of Imlad Morgul, were his words",
    "We are not in that valley now, and if we came on a spring it would be flowing into it and not out of it.",
    "I wonder",
    "No, they never end as tales",
    "And then we can have some rest and some sleep",
    "Why, Sam",
    "So was I",
    "Maybe",
    "Gollum!",
    "Sleep!",
    "Yes, even here I could sleep.",
    "Sleep then, master! Lay your head in my lap.",
    "Nothing, nothing",
    "Nice Master!",
    "I daresay",
    "Sneaking, sneaking!",
    "Sorry.",
    "Sneaking",
    "O very well",
    "No food, no rest, nothing for Smjagol",
    "He was given that name by kind Master Samwise, the hobbit that knows so much.",
    "Yes sir",
    "Come, let it pass then",
    "No, no, not yet",
    "Ugh! That smell!",
    "This is the way in",
    "This is the entrance to the tunnel.",
    "Yes, yes",
    "Yes, we must go this way now.",
    "And what makes the smell, I wonder",
    "Well",
    "Right or wrong, we must take the other.",
    "Master, master!",
    "Master, master!",
    "Cobwebs!",
    "It will take days to clear the road like this",
    "No, not to be seen",
    "That would not help us now",
    "Ores!",
    "Now come, you filth!",
    "Master, dear master",
    "Nothing.",
    "Hai! hai! yoi !",
    "How many are there?",
    "Like old times.",
    "Yes",
    "Bad business",
    "The Eye was busy elsewhere, I suppose",
    "Ah well, you always did take a gloomy view.",
    "Now, now",
    "You fool",
    "Garn!",
    "Put him right up in the top chamber.",
    "It will have to be paid for",
    "You had better come and live here, Frodo my lad",
    "But what about this Frodo that lives with him?",
    "Drownded?",
    "Well, so they say",
    "Ah, but he has likely enough been adding to what he brought at first",
    "G for Grand!",
    "Run away now!",
    "You will get plenty when the time comes.",
    "How bright your garden looks!",
    "Yes",
    "You mean to go on with your plan then?",
    "Who will laugh, I wonder?",
    "We shall see",
    "ProudFEET!",
    "One Gross, indeed! Vulgar expression.",
    "Hullo!",
    "I wondered if you would turn up.",
    "I am glad to find you visible",
    "Yes, I do",
    "No, it does not seem right",
    "No, after all I believe your plan is probably the best.",
    "Everything?",
    "The ring as well? You agreed to that, you remember.",
    "Well, er, yes, I suppose so",
    "Where is it?",
    "In an envelope, if you must know",
    "I think, Bilbo",
    "No, but I had to badger you",
    "Why not?",
    "Yes, yes",
    "But there is no need to get angry.",
    "If I am it is your fault",
    "It has been called that before",
    "Well, if you want my ring yourself, say so!",
    "I have never called you one",
    "Then trust mine",
    "All right",
    "Indeed it would take away the only point I ever saw in the affair",
    "Very well",
    "You have still got the ring in your pocket",
    "Well, so I have!",
    "Is everything ready?",
    "Everything packed and labelled?",
    "Everything",
    "Has he gone?",
    "Yes",
    "The ring!",
    "It may, and it may not",
    "He is indisposed",
    "He is resting.",
    "Hiding, you mean",
    "Only one thing is clear to me",
    "Foiled again!",
    "Did you hear that, Merry? That was an insult, if you like",
    "It was a compliment",
    "Lobelia again most likely",
    "My dear Gandalf! Half a minute!",
    "Come in! Come in! I thought it was Lobelia.",
    "Do be careful of that ring, Frodo ! In fact, it is partly about that that I have come to say a last word.",
    "Well, what about it?",
    "What do you know already?",
    "Which story, I wonder",
    "Oh, not what he told the dwarves and put in his book",
    "Well, what did you think of it all?",
    "Neither do I",
    "You are very mysterious! What are you afraid of?",
    "At once!",
    "Some people!",
    "So do I",
    "Where is he then?",
    "Perhaps I shall cross the River myself one day.",
    "Not yet.",
    "Ah",
    "No doubt you can",
    "All right",
    "All the same",
    "They are sailing, sailing, sailing over the Sea, they are going into the West and leaving us",
    "There are some, even in these parts, as know the Fair Folk and get news of them",
    "You look the same as ever, Frodo!",
    "So do you",
    "Last night you began to tell me strange things about my ring, Gandalf",
    "In many ways",
    "How terrifying!",
    "How long have you known this?",
    "And how much did Bilbo know?",
    "Bilbo knew no more than he told you, I am sure",
    "Yes, he warned me of that in his last letter",
    "Very wise",
    "How long have you known all this?",
    "Known?",
    "When did I first begin to guess?",
    "Who is he?",
    "Maybe not",
    "He felt better at once",
    "But why should we be?",
    "And why should he want such slaves?",
    "To tell you the truth",
    "Revenge?",
    "It has everything to do with it",
    "Can you see any markings on it?",
    "No",
    "Well then, look!",
    "Wait!",
    "Take it!",
    "Hold it up!",
    "And look closely!",
    "No",
    "This ring!",
    "How, how on earth did it come to me?",
    "Ah!",
    "I wish it need not have happened in my time",
    "So do I",
    "And how did the Enemy ever come to lose it, if he was so strong, and it was so precious to him?",
    "It was taken from him",
    "And there in the dark pools amid the Gladden Fields",
    "Gollum!",
    "I think it is a sad story",
    "What an abominable notion!",
    "It is true all the same",
    "Yes",
    "Only too true, I fear",
    "What do you mean?",
    "You ought to begin to understand, Frodo, after all you have heard",
    "What, just in time to meet Bilbo?",
    "It is no laughing matter",
    "And when did you discover that?",
    "Just now in this room, of course",
    "You have seen Gollum?",
    "Then what happened after Bilbo escaped from him? Do you know that?",
    "But how did he find that out?",
    "Is that where you found him?",
    "I saw him there",
    "Ah",
    "But this is terrible!",
    "I am sorry",
    "You have not seen him",
    "All the same",
    "Let you? Make you?",
    "But why not destroy it, as you say should have been done long ago?",
    "Would you? How would you do that? Have you ever tried?",
    "Try!",
    "I do really wish to destroy it!",
    "No!",
    "And now",
    "Well!",
    "What are you thinking about? Have you decided what to do?",
    "No!",
    "Whatever it may do, it will be slow, slow to evil, if you keep it with that purpose",
    "I hope so",
    "My dear Frodo!",
    "Well, well, bless my beard!",
    "Sam Gamgee is it? Now what may you be doing?",
    "Well, sir",
    "Come inside!",
    "Take you to see Elves, eh?",
    "Get up, Sam!",
    "Me, sir!",
    "Me go and see Elves and all! Hooray!",
    "You ought to go quietly, and you ought to go soon",
    "What about the autumn, on or after Our Birthday?",
    "I think I could probably make some arrangements by then.",
    "Very well",
    "As for where I am going",
    "I have been so taken up with the thoughts of leaving Bag End, and of saying farewell, that I have never even considered the direction",
    "But you cannot see very far",
    "No indeed!",
    "But in the meantime what course am I to lake?",
    "Rivendell!",
    "For a nice bit, loo",
    "At a bargain price",
    "Yes, I shall be moving this autumn",
    "Merry Brandybuck is looking out for a nice little hole for me, or perhaps a small house.",
    "Only for a short while, I hope",
    "Has anything happened?",
    "I may be back any day",
    "Someone must get there and warm the house before you arrive",
    "I shall get myself a bit into training, too",
    "Ours at last!",
    "Our last meal at Bag End!",
    "I am sick of questions and curiosity about my doings, I suppose",
    "What an inquisitive lot they all are!",
    "Sam!",
    "Sam! Time!",
    "Coming, sir!",
    "All aboard, Sam?",
    "Run down with this to your home, Sam!",
    "I am sure you have given me all the heaviest stuff",
    "I pity snails, and all that carry their homes on their backs.",
    "Be kind to a poor old hobbit!",
    "Well, we all like walking in the dark",
    "I wonder if I shall ever look down into that valley again",
    "I am so sleepy",
    "I thought you liked walking in the dark",
    "Hobbits!",
    "Wake up, hobbits!",
    "Water!",
    "We thought you had gone to find some",
    "You had better go now.",
    "You can come too",
    "Do Elves live in those woods?",
    "Not that I ever heard",
    "Or is it one of your imitations? It does not sound altogether encouraging.",
    "I can hear a pony or a horse coming along the road behind",
    "I wonder if that is Gandalf coming after us",
    "It may not matter much",
    "And I am still in the Shire",
    "Well, I call that very queer, and indeed disturbing",
    "But what has one of the Big People got to do with us?",
    "And what is he doing in this part of the world?",
    "There are some Men about",
    "Begging your pardon",
    "What do you mean?",
    "What about the smelling, sir?",
    "And the Gaffer said he was a black chap.",
    "I wish I had waited for Gandalf",
    "But perhaps it would only have made matters worse.",
    "Then you know or guess something about this rider?",
    "Yes, I think we will move on now",
    "That is the way for us",
    "And now to bed! And now to bed!",
    "Hush!",
    "I think I hear hoofs again.",
    "Very well!",
    "Elves!",
    "Elves, sir!",
    "Yes, it is Elves",
    "What about the Elves?",
    "Listen! They are coming this way",
    "We have only to wait.",
    "Hail, Frodo!",
    "This is indeed wonderful!",
    "The meaning of it, fair people",
    "But we have no need of other company, and hobbits are so dull",
    "And how do you know that we go the same way as you, for you do not know whither we are going?",
    "And how do you know my name?",
    "We know many things",
    "We have seen you often before with Bilbo, though you may not have seen us.",
    "Who are you, and who is your lord?",
    "I am Gildor",
    "O Wise People!",
    "Black Riders?",
    "Why do you ask about Black Riders?",
    "Because two Black Riders have overtaken us today, or one has done so twice",
    "We will not speak of this here",
    "O Fair Folk! This is good fortune beyond my hope",
    "I thank you indeed, Gildor Inglorion",
    "Be careful, friends!",
    "Why? Where are you going?",
    "Come!",
    "Come! Now is the time for speech and merriment!",
    "There is a fire in the hall, and food for hungry guests",
    "This is poor fare",
    "Here is a jewel among hobbits!",
    "Tell me, Gildor, have you ever seen Bilbo since he left us?",
    "Yes",
    "You do not ask me or tell me much that concerns yourself, Frodo",
    "It is",
    "The secret will not reach the Enemy from us",
    "The Enemy?",
    "Then you know why I am leaving the Shire?",
    "I do not know for what reason the Enemy is pursuing you",
    "Has Gandalf told you nothing?",
    "Nothing about such creatures.",
    "I cannot imagine what information could be more terrifying than your hints and warnings",
    "But it is not your own Shire",
    "I think you should still follow that plan",
    "I do not like this news",
    "And it is also said",
    "Is it indeed?",
    "I am deeply grateful",
    "Is it not enough to know that they are servants of the Enemy?",
    "But where shall I find courage?",
    "That is what I chiefly need.",
    "Courage is found in unlikely places",
    "I will sleep now",
    "They have left us fruit and drink, and bread",
    "What is the plan for today?",
    "To walk to Bucklebury as quickly as possible",
    "Do you think we shall see anything of those Riders?",
    "Yes, probably",
    "But I hope to get across the river without their seeing us.",
    "Did you find out anything about them from Gildor?",
    "Did you ask about the sniffing?",
    "In that case I am sure Gildor would have refused to explain it",
    "Good heavens!",
    "At breakfast?",
    "No! I could not!",
    "Well, Sam!",
    "Very good, sir!",
    "You still mean to come with me?",
    "I do.",
    "Who are they, and what are you talking about?",
    "They are",
    "Do you like them still, now you have had a closer view?",
    "They seem a bit above my likes and dislikes, so to speak",
    "All ready to start?",
    "You slept late, you mean",
    "Then you are going to fly",
    "We can cut straighter than the road anyway",
    "It is less easy to find people in the woods and fields",
    "And if you are supposed to be on the road, there is some chance that you will be looked for on the road and not off it.",
    "All right!",
    "That settles it!",
    "First check!",
    "Look!",
    "Whew!",
    "If we are going to try and get back on to our course, we must cross at once and bear right.",
    "And what do you think that was?",
    "If it was a bird, it was one that I never heard in the Shire before.",
    "It was not bird or beast",
    "I know these fields and this gate!",
    "One trouble after another!",
    "I know",
    "But all the same",
    "Hallo! Hallo! And who may you be, and what may you be wanting?",
    "What fellow do you mean?",
    "What about the dogs?",
    "Heel, Wolf!",
    "You may not remember him, but he used to live at Brandy Hall.",
    "Well, no",
    "If you were in a hurry, the road would have served you better",
    "Well",
    "Well, I see you have ideas of your own",
    "I was thinking so",
    "And so should we!",
    "I will!",
    "Hallo there!",
    "Now then!",
    "Yes, of course! Who did you think it was?",
    "So there you are at last!",
    "Well, good night to you all",
    "I was nearly forgetting",
    "Now we had better get home ourselves",
    "What in the Shire is that?",
    "Something that is following us",
    "Can horses cross the river?",
    "We had our supper early with Farmer Maggot",
    "You shall have it! Give me that basket!",
    "Well, what do you think of it?",
    "I hardly feel that I have moved at all.",
    "A bath!",
    "O blessed Meriadoc!",
    "Which order shall we go in?",
    "Trust me to arrange things better than that!",
    "What about supper and beer in the throat?",
    "Lawks!",
    "Yes we shall!",
    "We have all been scared",
    "You would have been, too, if you had been chased for two days by Black Riders.",
    "And what are they?",
    "Black figures riding on black horses",
    "I should think you were making it all up",
    "Cousin Frodo has been very close",
    "That was only a guess",
    "Maggot does not know anything.",
    "Old Maggot is a shrewd fellow",
    "Well!",
    "I think I could help you",
    "What do you mean?",
    "Dear old Frodo!",
    "Good heavens!",
    "Oh no!",
    "But I must go",
    "You do not understand!",
    "My dear and most beloved hobbits!",
    "Of course we understand",
    "Yes, the Ring",
    "Go on!",
    "You have read his book!",
    "Good heavens above! Is nothing safe?",
    "Not too safe, I should say",
    "Well, as I was saying",
    "Where is he?",
    "Sam!",
    "Yes, sir!",
    "But it does not seem that I can trust anyone",
    "It all depends on what you want",
    "And after all, sir",
    "You are a set of deceitful scoundrels!",
    "But bless you!",
    "Very good!",
    "Oh! That was poetry!",
    "Do you really mean to start before the break of day?",
    "The answer to the second question",
    "It seems to have been a very efficient conspiracy",
    "But what about the Black Riders? Would it be safe to wait one day for Gandalf?",
    "That all depends on what you think the Riders would do, if they found you here",
    "I have made up my mind",
    "But that can only mean going into the Old Forest!",
    "Not quite",
    "Oh yes they do!",
    "Well, do as you think best!",
    "Excellent!",
    "You wait till you are well inside the Forest",
    "All right! What is it?",
    "What is it!",
    "How are you going to get through this?",
    "Follow me!",
    "If there are no worse things ahead than the Old Forest, I shall be lucky",
    "You have left the Shire, and are now outside, and on the edge of the Old Forest.",
    "Are the stories about it true?",
    "Is it only the trees that are dangerous?",
    "There are various queer things living deep in the Forest, and on the far side",
    "You had better lead on and find that path",
    "Oi! Oi !",
    "I should not shout, if I were you",
    "It has not taken you long to lose us",
    "Well, well!",
    "That",
    "Well, now I have at least some notion of where we are!",
    "I dare say!",
    "No",
    "Come on!",
    "Wait for me, Sam",
    "Must bathe feet a minute.",
    "Do you know, Sam",
    "What about the others?",
    "I wonder what sort of dreams they are having.",
    "What a foul thing to happen!",
    "Why did we ever come into this dreadful Forest? I wish we were all back at Crickhollow!",
    "I brought a little hatchet for chopping firewood",
    "Wait a minute!",
    "We might do something with fire!",
    "We might",
    "We might succeed in roasting Pippin alive inside.",
    "We might try to hurt or frighten this tree to begin with",
    "Put it out! Put it out!",
    "Who? What?",
    "Put it out! Put it out!",
    "Help!",
    "What?",
    "You let them out again, Old Man Willow!",
    "Thank you!",
    "Well, my little fellows!",
    "Let us shut out the night!",
    "Fair lady Goldberry!",
    "Fair lady Goldberry!",
    "Welcome!",
    "Fair lady!",
    "Tell me, if my asking does not seem foolish, who is Tom Bombadil?",
    "He is",
    "He is, as you have seen him",
    "He is the Master of wood, water, and hill.",
    "Then all this strange land belongs to him?",
    "No indeed!",
    "That would indeed be a burden",
    "It is",
    "Have peace now",
    "Did you hear me calling, Master, or was it just chance that brought you at that moment?",
    "Eh, what?",
    "Tell us, Master",
    "Not now! Not until the morning!",
    "Black Riders!",
    "I shall be drowned!",
    "Hey! Come merry dol! derry dol! My hearties!",
    "Good morning, merry friends!",
    "The rain has ended",
    "And let us have food and drink!",
    "Supper is ready",
    "Show me the precious Ring!",
    "Hey there!",
    "Goldberry!",
    "My fair lady, clad all in silver green! We have never said farewell to her, nor seen her since the evening!",
    "And hold to your purpose! North with the wind in the left eye and a blessing on your footsteps! Make haste while the Sun shines!",
    "Splendid!",
    "If we make as good going this afternoon as we have done this morning, we shall have left the Downs before the Sun sets and be jogging on in search of a camping place.",
    "Come on! Follow me!",
    "Sam!",
    "Sam! Sam! Merry! Pippin!",
    "Hoy! Frodo! Hoy!",
    "Frodo! Hoy!",
    "Where are you?",
    "Here!",
    "I am waiting for you!",
    "No!",
    "Let us get out on to clean grass! You must help me bear them.",
    "What in the name of wonder?",
    "Of course, I remember!",
    "No! No!",
    "I thought that I was lost",
    "Dressed up like this, sir?",
    "Where are my clothes?",
    "What do you mean?",
    "Why not?",
    "Here are your ponies, now!",
    "Where does that other old animal, that Fatty Lumpkin, come from?",
    "Few now remember them",
    "Well, here we are again at last!",
    "Do you think",
    "No, I hope not tonight",
    "I am sorry to take leave of Master Bombadil",
    "There are hobbits in Bree",
    "It may be all we could wish",
    "We are making for the inn here",
    "We are journeying east and cannot go further tonight.",
    "Our names and our business are our own, and this does not seem a good place to discuss them",
    "Your business is your own, no doubt",
    "We are hobbits from Buckland, and we have a fancy to travel and to stay at the inn here",
    "All right, all right!",
    "Half a minute, if you please!",
    "Good evening, little master!",
    "What may you be wanting?",
    "Hobbits!",
    "Now what does that remind me of? Might I ask your names, sir?",
    "There now!",
    "Hi! Nob!",
    "Coming, sir! Coming!",
    "Well, now, what was I going to say?",
    "Here is a nice little parlour!",
    "Will you be wanting anything to drink, masters?",
    "And shall I show you the bedrooms, while your supper is got ready?",
    "All right!",
    "Him?",
    "I am called Strider",
    "He did",
    "Well, Master Underhill",
    "And there have been even stranger travellers through Bree lately",
    "You had better do something quick!",
    "A song!",
    "A song! A song!",
    "Well?",
    "Oh yes, you do",
    "What about?",
    "You may hear something to your advantage.",
    "Very well",
    "Yes I do!",
    "Well, where is he now?",
    "Frightening my customers and breaking up my crocks with your acrobatics!",
    "I am very sorry to have caused any trouble",
    "Certainly!",
    "Hallo!",
    "Who are you, and what do you want?",
    "I am called Strider",
    "You said I might hear something to my advantage, I believe",
    "What have you to say?",
    "Several things",
    "But, of course, I have my price.",
    "What do you mean?",
    "And what will that be, pray?",
    "No more than you can afford",
    "Oh, indeed!",
    "Even if I wanted another companion, I should not agree to any such thing, until I knew a good deal more about you, and your business.",
    "Excellent!",
    "Go on then!",
    "What do you know?",
    "I have quick ears",
    "Well answered!",
    "Watch every shadow!",
    "I ought to have guessed it from the way the gatekeeper greeted us",
    "It would have been better",
    "Well, I have rather a rascally look, have I not?",
    "It was sheer accident!",
    "I wonder",
    "Hardly more than it was already",
    "You must not count on that!",
    "And there are some folk in Bree who are not to be trusted",
    "What will Ferny sell, and what has my accident got to do with him?",
    "News of you, of course",
    "There!",
    "No",
    "The lesson in caution has been well learned",
    "Nob! Take the water to the rooms!",
    "And what has that got to do with me?",
    "Ah! you know best",
    "He said it? And who was he?",
    "Well, what have you done?",
    "Where was I?",
    "A letter for me from Gandalf!",
    "Ah!",
    "Then your right name is Baggins?",
    "It is",
    "What do you mean?",
    "These black men",
    "Fie did!",
    "And much trouble would have been saved, if you had let him in, Barliman.",
    "You!",
    "He came to offer me his help.",
    "Well, you know your own business, maybe",
    "Then who would you take up with?",
    "They come from Mordor",
    "From Mordor, Barliman, if that means anything to you.",
    "Save us!",
    "That is the worst news that has come to Bree in my time.",
    "It is",
    "Are you still willing to help me?",
    "I am",
    "Against the Shadow in the East",
    "I hope not, indeed",
    "In any case we must be called at dawn",
    "Well?",
    "When are you going to open that letter?",
    "Really old Butterbur has made a mess of things!",
    "He has been doing that for many years",
    "It would have saved time.",
    "Would it? Would any of you have believed me till now?",
    "It would take more than a few days, or weeks, or years, of wandering in the Wild to make you look like Strider",
    "And you would die first, unless you are made of sterner stuff than you look to be.",
    "How do we know you are the Strider that Gandalf speaks about?",
    "That you are a stout fellow",
    "But I am the real Strider, fortunately",
    "I believed that you were a friend before the letter came",
    "I see",
    "Did the verses apply to you then?",
    "I did not know",
    "But I am Aragorn, and those verses go with that name.",
    "Not much use is it, Sam?",
    "But the time is near when it shall be forged anew.",
    "Well",
    "Weathertop?",
    "Do you know where he is, or what he is doing?",
    "I do not know",
    "I do not know of anything else that could have hindered him, except the Enemy himself",
    "I am sorry",
    "I have seen them, Frodo! I have seen them! Black Riders!",
    "Black Riders!",
    "Where?",
    "Which way did it go?",
    "Go on!",
    "It seemed to make off up the Road, eastward",
    "You have a stout heart",
    "I found him, sir",
    "I do",
    "What will happen?",
    "Will they attack the inn?",
    "No, I think not",
    "We seem to have enemies all round",
    "What are we to do?",
    "Well Masters",
    "But what will happen when they have penetrated the disguise?",
    "We shall see",
    "Fet us hope to hold the fort till morning.",
    "Good night to you",
    "Jumped over the Moon!",
    "I hope so",
    "Open, in the name of Mordor!",
    "No, no, no!",
    "Never has such a thing happened in my time!",
    "Dark times",
    "Ponies would not help us to escape horsemen",
    "As much as we must",
    "I can carry enough for two",
    "I doubt it",
    "Yes",
    "There is one crumb of comfort",
    "Bill Ferny?",
    "I wonder",
    "I hope we shall meet again some day, when things are merry once more",
    "I should like nothing better than to stay in your house in peace for a while.",
    "Apples for walking, and a pipe for sitting",
    "He looks more than half like a goblin.",
    "Morning, Longshanks!",
    "Off early? Found some friends at last?",
    "Morning, my little friends!",
    "Waste of a good apple",
    "This is where we leave the open and take to cover",
    "Our last short cut through woods nearly ended in disaster.",
    "Ah, but you had not got me with you then",
    "Bill Ferny will have watched where we left the Road, for certain",
    "I am being eaten alive!",
    "Midgewater! There are more midges than water!",
    "What is the light?",
    "I do not know",
    "That is Weathertop",
    "But surely we were hoping to find Gandalf there?",
    "You do make me feel uncomfortable and lonesome, Strider!",
    "What do you advise us to do?",
    "I think",
    "Very odd",
    "Do not speak of such things!",
    "I wonder who made this path, and what for",
    "He did not make it up",
    "There was a lot more",
    "Do not speak that name so loudly!",
    "Well, here we are!",
    "I wonder",
    "What do you think of these marks?",
    "There seems to he a stroke, a dot, and three more strokes",
    "What could they mean, even if Gandalf made them?",
    "I should say",
    "I wish we could feel sure that he made the marks, whatever they may mean",
    "It would be a great comfort to know that he was on the way, in front of us or behind us.",
    "Perhaps",
    "How far is Rivendell?",
    "A fortnight!",
    "A lot may happen in that time.",
    "It may",
    "Look",
    "What is it?",
    "I do not know, but I fear the worst",
    "Yes",
    "The enemy is here!",
    "I wonder if old Gandalf has been here",
    "Whoever it was put this stuff here meant to come back it seems.",
    "I wish I had waited and explored the ground down here myself",
    "It is just as I feared",
    "Yes, we certainly must decide what to do at once",
    "Well, Sam",
    "Can the Riders see ?",
    "Is there no escape then?",
    "If I move I shall be seen and hunted! If I stay, I shall draw them to me!",
    "There is still hope",
    "Maybe",
    "There is food in the wild",
    "Do you know any more of that old lay that you spoke of?",
    "I do indeed",
    "So also does Frodo, for it concerns us closely.",
    "I know only the little that Gandalf has told me",
    "No!",
    "Then tell us some other tale of the old days",
    "Look!",
    "Did you see anything?",
    "I saw something",
    "Keep close to the fire, with your faces outward!",
    "Get some of the longer sticks ready in your hands!",
    "Hush!",
    "What has happened? Where is the pale king?",
    "I am not a Black Rider, Sam",
    "Keep the fire going well, and keep Frodo warm!",
    "I think I understand things better now",
    "Look!",
    "And more deadly to Frodo was this!",
    "Alas!",
    "These leaves",
    "I think now",
    "That is Loudwater, the Bruinen of Rivendell",
    "I can see no sign of the enemy",
    "I found it in the mud in the middle of the Bridge",
    "Who lives in this land?",
    "No!",
    "Where did you learn such tales, if all the land is empty and forgetful?",
    "The birds and beasts do not tell tales of that son.",
    "The heirs of Elendil do not forget all things past",
    "Have you often been to Rivendell?",
    "I have",
    "We have come too far to the north",
    "We cannot go any further",
    "We shall see",
    "What is the matter with my master?",
    "Frodo has been touched by the weapons of the Enemy",
    "We must make for the Road again",
    "There is a path here!",
    "There is no need, I think",
    "There are trolls!",
    "We will come and look at them",
    "Get up, old stone!",
    "Well!",
    "We are forgetting our family history! These must be the very three that were caught by Gandalf, quarrelling over the right way to cook thirteen dwarves and one hobbit.",
    "I had no idea we were anywhere near the place!",
    "You are forgetting not only your family history, but all you ever knew about trolls",
    "Not since Weathertop",
    "Come on, Sam!",
    "It is as well you used a stick, and not your hand, Strider!",
    "Where did you come by that, Sam?",
    "I hope not",
    "There!",
    "None at all",
    "This is Glorfindel, who dwells in the house of Elrond",
    "Hail, and well met at last!",
    "Then Gandalf has reached Rivendell?",
    "My master is sick and wounded",
    "There are evil things written on this hilt",
    "You shall ride my horse",
    "No, he will not!",
    "I shall not ride him, if I am to be carried off to Rivendell or anywhere else, leaving my friends behind in danger.",
    "I doubt very much",
    "Drink this!",
    "Our peril will be greatest just ere we reach the river",
    "Fly!",
    "Ride on! Ride on!",
    "Go back!",
    "Come back! Come back!",
    "To Mordor we will take you!",
    "Where am I, and what is the time?",
    "Gandalf!",
    "Yes",
    "And are the others all right?",
    "Yes, they are all safe and sound",
    "Sam was here until I sent him off to get some rest, about half an hour ago.",
    "What happened at the Ford?",
    "You seem to know a great deal already",
    "You have talked long in your sleep, Frodo",
    "We should never have done it without Strider",
    "I was delayed",
    "I wish you would tell me what happened!",
    "You will soon hear all you wish to know",
    "You?",
    "Yes, I, Gandalf the Grey",
    "Yes",
    "He has no more doubts now.",
    "I am glad",
    "Do you really mean that Strider is one of the people of the old Kings?",
    "Only a Ranger!",
    "I suppose not",
    "I have been reckoning",
    "You have talked and reckoned more than is good for you",
    "Good!",
    "Days?",
    "Thank goodness I did not realize the horrible danger!",
    "Yes, fortune or fate have helped you",
    "I know",
    "They were terrible to behold! But why could we all see their horses?",
    "Still",
    "Still that must be expected",
    "You look splendid",
    "And is that the end of the Black Riders?",
    "No",
    "Who made the flood?",
    "Elrond commanded it",
    "Splendid!",
    "But now for a merry meeting!",
    "I am ready",
    "I can take you to them, sir",
    "I know what you have been doing, Sam",
    "Hurray!",
    "Here is our noble cousin! Make way for Frodo, Lord of the Ring!",
    "Hush!",
    "I feel like singing myself",
    "Welcome and well met!",
    "Gluin at your service",
    "Am I right in guessing that you are the Gluin, one of the twelve companions of the great Thorin Oaken shield?",
    "Quite right",
    "You have had some very strange adventures, I hear",
    "I think we will not speak of it, at least not yet",
    "But I am equally curious",
    "Indeed",
    "And what of your own people?",
    "There is much to tell, good and bad",
    "And what has become of Balin and Ori and Uin?",
    "We do not know",
    "We have done well",
    "I will come and see them, if ever I can",
    "How surprised Bilbo would have been to see all the changes in the Desolation of Smaug!",
    "You were very fond of Bilbo were you not?",
    "Yes",
    "Now at last the hour has come that you have wished for, Frodo",
    "Here is a friend that you have long missed.",
    "Bilbo!",
    "He shall be found",
    "Then you two shall go into a corner and finish your task, and we will hear it and judge it before we end our merrymaking.",
    "I got here without much adventure",
    "Have you got it here?",
    "It looks just the same as ever it did.",
    "Well, I should just like to see it for a moment",
    "I understand now",
    "Strider!",
    "You seem to have a lot of names.",
    "I know",
    "Well, my dear fellow",
    "Come then!",
    "Now we had better have it again",
    "But it would be too tiring to repeat it all.",
    "Not too tiring for you",
    "What!",
    "Nonsense, Lindir",
    "I am not going to try and guess",
    "And begging yours, Sam Gamgee",
    "I guess you mean that it is time your master went to bed.",
    "Well, sir, there is a Council early tomorrow, I hear and he only got up today for the first time.",
    "Quite right, Sam",
    "Hullo! Good morning!",
    "I feel ready for anything",
    "You may have a chance later",
    "That is the warning bell for the Council of Elrond",
    "Come along now! Both you and Bilbo are wanted.",
    "Here",
    "It is now many years ago",
    "You have done well to come",
    "I remember well the splendour of their banners",
    "But I thought",
    "So it was indeed",
    "So that is what became of the Ring!",
    "Alas! yes",
    "Here is the Sword that was Broken!",
    "He is Aragorn son of Arathorn",
    "Then it belongs to you, and not to me at all!",
    "It does not belong to either of us",
    "Bring out the Ring, Frodo!",
    "The Halfling!",
    "I was not sent to beg any boon, but to seek only the meaning of a riddle",
    "I made that up myself",
    "For my part I forgive your doubt",
    "That shall be told",
    "Very well",
    "Well told, my friend",
    "Not bad",
    "Yes, it made quite a long tale",
    "The questions that you ask, Galdor, are bound together",
    "Some, Galdor",
    "There I was at fault",
    "From the first my heart misgave me, against all reason that I knew",
    "And I",
    "Some in the North, maybe",
    "But in that time also he made this scroll",
    "Yes, long and weary",
    "And let us hope that none will ever speak it here again",
    "He is in prison, but no worse",
    "Escaped?",
    "Not through lack of watchfulness",
    "You were less tender to me",
    "Now come!",
    "Well, well, he is gone",
    "I saw you!",
    "Then it was late in coming",
    "What did you do to him?",
    "He was really very kind to us and did all that he could.",
    "This is grievous news concerning Saruman",
    "He would not have come",
    "It seems that he has a power even over the Ring.",
    "But within those bounds nothing seems to dismay him",
    "Not safe for ever",
    "And that we shall not find on the roads to the Sea",
    "Long yet will that march be delayed",
    "And yet its vigilance can no longer keep back the Nine",
    "And other roads he may find that Gondor does not guard.",
    "Then",
    "None here can do so",
    "Nor I",
    "May the day not be too long delayed",
    "Still it might be well for all",
    "Balin will find no ring in Moria",
    "Ah, alas!",
    "We know not for certain",
    "Yet all the Elves are willing to endure this chance",
    "Thus we return once more to the destroying of the Ring",
    "Despair, or folly?",
    "At least for a while",
    "Very well, very well, Master Elrond!",
    "I have never known you give me pleasant advice before.",
    "I will take the Ring",
    "If I understand aright all that I have heard",
    "No indeed!",
    "Instead of throwing him out, and clapping him in chains, Elrond goes and rewards him for his cheek!",
    "Rewards!",
    "Then you certainly will not be chosen, Peregrin Took!",
    "You were wrong",
    "Well, anyway",
    "Yes",
    "Ah!",
    "I am afraid it will",
    "You cannot destroy Ringwraiths like that",
    "Yes, several, and all are dark and unpleasant",
    "It will do well, if it ever comes to that",
    "Ah!",
    "The time has come",
    "I do",
    "I will go with Sam.",
    "Then I cannot help you much, not even with counsel",
    "Strider!",
    "I ask leave once again to be your companion, Frodo.",
    "I am",
    "But that will leave no place for us!",
    "That is because you do not understand and cannot imagine what lies ahead",
    "Neither does Frodo",
    "You speak gravely",
    "Then, Master Elrond, you will have to lock me in prison, or send me home tied in a sack",
    "Here is your sword",
    "Also there is this!",
    "Very well, I will take it",
    "Just a plain hobbit you look",
    "I cannot thank you as I should, Bilbo, for this, and for all our past kindnesses",
    "Ow!",
    "You should fear the many eyes of the servants of Sauron",
    "Loud and clear it sounds in the valleys of the hills",
    "Maybe",
    "But always I have let my horn cry at setting forth, and though thereafter we may walk in the shadows, I will not go forth as a thief in the night.",
    "That animal can nearly talk",
    "Rope!",
    "This is my last word",
    "Faithless is he that says farewell when the road darkens",
    "Maybe",
    "Yet sworn word may strengthen quaking heart",
    "Or break it",
    "No",
    "Yes I did, sometimes",
    "I need no map",
    "It is for the Dimrill Dale that we are making",
    "Yes, and where then?",
    "Lie flat and still!",
    "Regiments of black crows are flying over all the land between the Mountains and the Greyflood",
    "And in that case so is the Redhorn Gate",
    "Luckily our fire made little smoke, and had burned low before the crebain came",
    "It must be put out and not lit again.",
    "Well, you can go on looking forward",
    "Did you see anything pass over?",
    "No, but I felt it, whatever it was",
    "It may be nothing, only a wisp of thin cloud.",
    "It was moving fast then",
    "Winter deepens behind us",
    "I think no good of our course from beginning to end, as you know well, Gandalf",
    "Who knows indeed!",
    "We must decide before we go further",
    "Then let us weigh the matter in our minds, while the others rest and sleep",
    "I will add a word of advice, if I may",
    "Very well",
    "What do you say now, Aragorn?",
    "That I feared it too",
    "I wonder if this is a contrivance of the Enemy",
    "His arm has grown long indeed",
    "His arm has grown long",
    "We cannot go further tonight",
    "I do call it the wind",
    "But what can we do?",
    "Either stop where we are, or go back",
    "And it is no good going back while the storm holds",
    "Shelter!",
    "If this is shelter, then one wall and no roof make a house.",
    "This will be the death of the halflings, Gandalf",
    "If any dawn can pierce these clouds",
    "The snow is growing less",
    "Caradhras has not forgiven us.",
    "If Gandalf would go before us with a bright flame, he might melt a path for you",
    "Well",
    "Farewell!",
    "I go to find the Sun!",
    "Well",
    "Ah, it is as I said",
    "But happily your Caradhras has forgotten that you have Men with you",
    "But how are we to get down there, even if you have cut through the drift?",
    "Have hope!",
    "Enough, enough!",
    "We are departing as quickly as we may!",
    "We cannot, of course, go on again tonight",
    "The attack on the Redhorn Gate has tired us out, and we must rest here for a while.",
    "We still have our journey and our errand before us",
    "We have no choice but to go on, or to return to Rivendell.",
    "You are right, Frodo",
    "Then we must go on, if there is a way",
    "There is a way that we may attempt",
    "If it is a worse road than the Redhorn Gate, then it must be evil indeed",
    "But you had better tell us about it, and let us know the worst at once.",
    "The road that I speak of leads to the Mines of Moria",
    "It is a name of ill omen",
    "Things have changed since you came north, Boromir",
    "We do not know what he expects",
    "You speak of what you do not know, when you liken Moria to the stronghold of Sauron",
    "I too once passed the Dimrill Gate",
    "Nor me",
    "I will",
    "I will",
    "I will not go",
    "I do not wish to go",
    "Then let us start as soon as it is light tomorrow, if we can",
    "The wolf that one hears is worse than the ore that one fears.",
    "True!",
    "But where the warg howls, there also the ore prowls.",
    "I do not know which to hope",
    "There are the Walls of Moria",
    "We must find a way round the northern edge",
    "I am sorry",
    "It was not the fault of the Dwarves that the friendship waned",
    "I have not heard that it was the fault of the Elves",
    "I have heard both",
    "I am sorry, Sam",
    "It will be short of murder, I hope",
    "Well, here we are and all ready",
    "They are invisible, and their own masters cannot find them or open them, if their secret is forgotten.",
    "But this Door was not made to be a secret known only to Dwarves",
    "Look!",
    "There are the emblems of Dunn!",
    "And there is the Tree of the High Elves!",
    "And the Star of the House of Flanor",
    "What does it mean by speak, friend, and enter!",
    "It is",
    "Knock on the doors with your head, Peregrin Took",
    "Of course, of course! Absurdly simple, like most riddles when you see the answer.",
    "I felt that something horrible was near from the moment that my foot first touched the water",
    "I do not know",
    "I will",
    "I cannot say",
    "I have no memory of this place at all!",
    "One of you might have fallen in and still be wondering when you were going to strike the bottom",
    "Let the guide go first while you have one.",
    "This seems to have been a guardroom, made for the watching of the three passages",
    "That was the sound of a hammer, or I have never heard one",
    "Yes",
    "Get into a corner and have a sleep, my lad",
    "I know what is the matter with me",
    "I need smoke ! I have not tasted it since the morning before the snowstorm.",
    "And in the watches I have made up my mind",
    "I chose the right way",
    "That is all that I shall venture on for the present",
    "Yes",
    "I must have nearly fallen asleep on guard",
    "I was on the edge of a dream.",
    "I shall be glad",
    "He is dead then",
    "The Chamber of Records",
    "Well, I can read no more for a long way",
    "I fear he had ill tidings to record in a fair hand",
    "It is grim reading",
    "It was well for us that the pool had sunk a little, and that the Watcher was sleeping down at the southern end.",
    "They seem to have made a last stand by both doors",
    "Back to the hall",
    "We cannot get out",
    "There are Orcs, very many of them",
    "And no hope at all, if they come at the other door as well",
    "There is no sound outside here yet",
    "Let us go, before the troll returns!",
    "I am all right",
    "Well",
    "There is some new devilry here",
    "If we had come by the main road down from the upper halls, we should have been trapped here",
    "A Balrog",
    "Now I understand.",
    "What an evil fortune! And I am already weary.",
    "Over the bridge!",
    "You cannot pass",
    "Elendil!",
    "Alas! I Fear we cannot stay here longer",
    "We must do without hope",
    "Yonder is the Dimrill Stair",
    "Or Caradhras less cruel",
    "This pillar marks the spot where Durin first looked in the Mirrormere",
    "Let us look ourselves once, ere we go!",
    "Here is the spring from which the Silverlode rises.",
    "Do not drink of it! It is icy cold.",
    "My heart will be glad, even in the winter",
    "I am all right",
    "All I needed was some food and a little rest.",
    "And all the arrows of all the hunters in the world would be in vain",
    "I have often wondered what you and Bilbo were doing, so close in his little room",
    "The mail is marvellously light",
    "Not a sound but the wind",
    "Come! Let us hurry! The others are out of sight.",
    "If Elves indeed still dwell here in the darkening world",
    "It is long since any of my own folk journeyed hither back to the land whence we wandered in ages long ago",
    "Indeed deep in the wood they dwell",
    "A plain road, though it led through a hedge of swords",
    "Perilous indeed",
    "I cannot sing any more",
    "But the Dwarves did not make the evil",
    "And even in these latter days dwelling in the trees might be thought safer than sitting on the ground",
    "Your words bring good counsel, Gimli",
    "Whatever it may be",
    "Then dig a hole in the ground",
    "Yes, they are Elves",
    "Welcome!",
    "Eight",
    "The name of Aragorn son of Arathorn is known in Lurien",
    "The eighth is a dwarf",
    "Elrond himself chose him to be one of our companions, and he has been brave and faithful.",
    "Very good",
    "There!",
    "You had no need of your burdens",
    "There was something in this tree that I have never seen before",
    "Farewell",
    "There is one of my people yonder across the stream",
    "Celebrant is already a strong stream here, as you see",
    "No!",
    "Now, friends",
    "The agreement was made without my consent",
    "I will go forward free",
    "You cannot go back",
    "Come!",
    "You will have no claim",
    "Folly it may seem",
    "Also",
    "Behold! You are come to Cerin Amroth",
    "You feel the power of the Lady of the Galadhrim",
    "There lies the fastness of Southern Mirkwood",
    "Here is the heart of Elvendom on earth",
    "Here dwell Celeborn and Galadriel",
    "When all have come we will speak together.",
    "Welcome son of Thranduil! Too seldom do my kindred journey hither from the North.",
    "Here there are eight",
    "Nay, there was no change of counsel",
    "These are evil tidings",
    "We have not spoken to Haldir of our deeds or our purpose",
    "At first we were weary and danger was too close behind and afterwards we almost forgot our grief for a time, as we walked in gladness on the fair paths of Lurien.",
    "Yet our grief is great and our loss cannot be mended",
    "An evil of the Ancient World it seemed, such as I have never seen before",
    "It was both a shadow and a flame, strong and terrible.",
    "It was a Balrog of Morgoth",
    "He would be rash indeed that said that thing",
    "Your quest is known to us",
    "Do not let your hearts be troubled",
    "Tonight you shall sleep in peace.",
    "And it seemed to me, too",
    "To me it seemed exceedingly strange",
    "Yes",
    "No, I am afraid not",
    "But that is the best I can do yet.",
    "You can see and feel it everywhere",
    "Well",
    "Yet I hope very much that before we leave we shall see the Lady of the Elves again.",
    "Many things I can command the Mirror to reveal",
    "I did",
    "Like as not",
    "Hi!",
    "Do not touch the water!",
    "Yes",
    "You are wise and fearless and fair, Lady Galadriel",
    "Wise the Lady Galadriel may be",
    "I pass the test",
    "I will diminish, and go into the West and remain Galadriel.",
    "In the morning you must depart for now we have chosen, and the tides of fate are flowing.",
    "I would ask one thing before we go",
    "No, Lady",
    "I would",
    "Now is the time",
    "All shall be prepared for you and await you at the haven before noon tomorrow",
    "I shall go to Minas Tirith, alone if need be, for it is my duty",
    "It would be folly to throw lives away, I mean",
    "Cram",
    "No more, no more!",
    "I have returned from the Northern Fences",
    "They are made of hithlain",
    "We have come to bid you our last farewell",
    "As you go down the water",
    "Indeed we have heard of Fangorn in Minas Tirith",
    "Then I need say no more",
    "Now it is time to drink the cup of farewell",
    "We have drunk the cup of parting",
    "Here is the gift of Celeborn and Galadriel to the leader of your Company",
    "The blade that is drawn from this sheath shall not be stained or broken even in defeat",
    "Yet maybe this will lighten your heart",
    "For you little gardener and lover of trees",
    "Here is set G for Galadriel",
    "It is enough for me to have seen the Lady of the Galadhrim, and to have heard her gentle words.",
    "Let none say again that Dwarves are grasping and ungracious! Yet surely, Gimli son of Gluin, you desire something that I could give? Name it, I bid you! You shall not be the only guest without a gift.",
    "There is nothing, Lady Galadriel",
    "I have looked the last upon that which was fairest",
    "Henceforward I will call nothing fair, unless it be her gift.",
    "Maybe",
    "Yes",
    "Ah",
    "Yes, that is what I have feared for some time",
    "Gollum",
    "Or at least, so I guess.",
    "We will not start until it is fully dark",
    "That was a mighty shot in the dark, my friend!",
    "But who can say what it hit?",
    "I cannot",
    "It was not a Balrog",
    "Whatever it was, its fall has dismayed our enemies.",
    "So it seems",
    "Nay, time does not tarry ever",
    "But the wearing is slow in Lurien",
    "That should not have been said outside Lurien, not even to me",
    "Perhaps so",
    "I do not see why we should pass the Rapids or follow the River any further",
    "But the Enemy holds the eastern bank",
    "It is not the way of the Men of Minas Tirith to desert their friends at need",
    "Well, here we are, and here we must pass another night",
    "Let us rest as much as we can now",
    "Fear not!",
    "Here we will rest tonight",
    "It is not your watch.",
    "Let us see what Sting may show",
    "I feared as much",
    "The day has come at last",
    "Well, Frodo",
    "Very well, Frodo son of Drogo",
    "I was afraid for you, Frodo",
    "You are kind",
    "And it would seem like wisdom but for the warning of my heart.",
    "Yet that strength has long protected you far away in your little country, though you knew it not.",
    "No hope while the Ring lasts",
    "It is best that it should lie hidden",
    "So you go on",
    "And they tell us to throw it away!",
    "Surely you see it, my friend?",
    "No, I am afraid",
    "The Council laid it upon me to bear it.",
    "Miserable trickster!",
    "We must stop him",
    "Begging your pardon",
    "I believe you speak more wisely than any of us, Sam",
    "Yes",
    "Yes",
    "This is bad!",
    "Not when he had escaped the unwelcome visitor, like Bilbo used to.",
    "Half an hour, maybe",
    "Of course it is",
    "Good Morning!",
    "What do you mean?",
    "All of them at once",
    "Very pretty!",
    "Good morning!",
    "What a lot of things you do use Good morning for!",
    "Dear me!",
    "Where else should I be?",
    "What on earth did I ask him to tea for!",
    "I am so sorry to keep you waiting!",
    "Dwalin at your service!",
    "Bilbo Baggins at yours!",
    "Excuse me!",
    "So you have got here at last!",
    "I see they have begun to arrive already",
    "Balin at your service!",
    "Thank you!",
    "Come along in, and have some tea!",
    "A little beer would suit me better, if it is all the same to you, my good sir",
    "Lots!",
    "Gandalf for certain this time",
    "What can I do for you, my dwarves?",
    "Kili at your service!",
    "And Fili!",
    "Dwalin and Balin here already, I see",
    "Let us join the throng!",
    "Throng!",
    "Someone at the door!",
    "Some four, I should say by the sound",
    "Besides, we saw them coming along behind us in the distance.",
    "Carefully! Carefully!",
    "At your service!",
    "Now we are all here!",
    "And for me",
    "And just bring out the cold chicken and pickles!",
    "Seems to know as much about the inside of my larders as I do myself!",
    "Confusticate and bebother these dwarves!",
    "I suppose you will all stay to supper?",
    "Of course!",
    "Now for some music!",
    "Bring out the instruments!",
    "Excuse me, I left mine in the porch!",
    "Just bring mine in with you!",
    "Where are you going?",
    "What about a little light?",
    "We like the dark",
    "Dark for dark business! There are many hours before dawn.",
    "Of course!",
    "Hush!",
    "Let Thorin speak!",
    "Excitable little fellow",
    "Humph!",
    "Pardon me",
    "Yes, yes, but that was long ago",
    "Of course there is a mark",
    "This was made by Thror, your grandfather, Thorin",
    "It is a plan of the Mountain.",
    "There is a dragon marked in red on the Mountain",
    "It may have been secret once",
    "Why?",
    "It seems a great big hole to me",
    "How could such a large door be kept secret from everybody outside, apart from the dragon?",
    "In lots of ways",
    "Quite right",
    "Also",
    "Keep it safe!",
    "Indeed I will",
    "A long time before that, if I know anything about the roads East",
    "We might go from there up along the River Running",
    "That would be no good",
    "Very well then",
    "First I should like to know a bit more about things",
    "I mean about the gold and the dragon, and all that, and how it got there, and who it belongs to, and so on and further.",
    "Bless me!",
    "All the same, I should like it all plain and clear",
    "What am I going to get out of it? and am I going to come back alive?",
    "O very well",
    "Your grandfather Thror was killed, you remember, in the mines of Moria by Azog the Goblin .",
    "Curse his name, yes",
    "True, true",
    "Your grandfather",
    "Whatever were you doing there?",
    "We have long ago paid the goblins of Moria",
    "Hear, hear!",
    "Hear what?",
    "Hear what I have got to say!",
    "Before we go, I suppose you mean",
    "My dear fellow",
    "What message?",
    "Great Elephants!",
    "If you had dusted the mantelpiece, you would have found this just under the clock",
    "No time for it",
    "No time for that either! Off you go!",
    "Bravo!",
    "Up you two get, and off we go!",
    "To think it will soon be June!",
    "Bother burgling and everything to do with it! I wish I was at home in my nice hole by the fire, with the kettle just beginning to sing!",
    "Just when a wizard would have been most useful, too",
    "After all there are fourteen of us.",
    "Where has Gandalf got to?",
    "After all we have got a burglar with us",
    "You must go on and find out all about that light, and what it is for, and if all is perfectly safe and canny",
    "Never a blinking bit of manflesh have we had for long enough",
    "Shut yer mouth!",
    "Ha!",
    "What is it?",
    "Lumme, if I knows! What are yer?",
    "A burrahobbit?",
    "Yer can try",
    "Yes, lots",
    "No none at all, not one",
    "What I say",
    "Poor little blighter",
    "Poor little blighter! Let him go!",
    "Not till he says what he means by lots and none at all",
    "I caught him anyway.",
    "O! are they?",
    "You are",
    "Shut up!",
    "Shut up yerself!",
    "Booby yerself!",
    "Who shall we sit on first?",
    "Better sit on the last fellow first",
    "The one with the yellow stockings",
    "Nonsense, the one with the grey stockings",
    "I made sure it was yellow",
    "Yellow it was",
    "Then what did yer say it was grey for?",
    "That I never did!",
    "It was you.",
    "Two to one, so shut yer mouth!",
    "Now stop it!",
    "Dawn take you all, and be stone to you!",
    "Excellent!",
    "Would this be any good?",
    "I found it on the ground where the trolls had their fight.",
    "These look like good blades",
    "Where did you go to, if I may ask?",
    "To look ahead",
    "And what brought you back in the nick of time?",
    "Looking behind",
    "Exactly!",
    "Thank you!",
    "Is that The Mountain?",
    "Of course not!",
    "O!",
    "We must not miss the road, or we shall be done for",
    "Here it is at last!",
    "Hmmm! it smells like elves!",
    "Well, well!",
    "Most astonishing wonderful!",
    "Welcome to the valley!",
    "Thank you!",
    "You are a little out of your way",
    "It is long enough without watering it.",
    "Hush, hush! Good People! and good night!",
    "Whence did the trolls get them, I wonder?",
    "I could not say",
    "I will keep this sword in honour",
    "May it soon cleave goblins once again!",
    "A wish that is likely to be granted soon enough in the mountains!",
    "But show me now your map!",
    "What is this?",
    "What do they say?",
    "Durin, Durin!",
    "That remains to be seen",
    "Is there any more writing?",
    "None to be seen by this moon",
    "The summer is getting on down below",
    "Well, if you know of anywhere better, take us there!",
    "We have found a dry cave",
    "Have you thoroughly explored it?",
    "Yes, yes!",
    "Who are these miserable persons?",
    "Dwarves, and this!",
    "We found them sheltering in our Front Porch.",
    "What do you mean by it?",
    "Thorin the dwarf at your service!",
    "Um!",
    "We were on a journey to visit our relatives, our nephews and nieces, and first, second, and third cousins, and the other descendants of our grandfathers, who live on the East side of these truly hospitable mountains",
    "He is a liar, O truly tremendous one!",
    "Slash them! Beat them! Bite them! Gnash them! Take them away to dark holes full of snakes, and never let them see the light again!",
    "Follow me quick!",
    "Quicker, quicker!",
    "The torches will soon be relit.",
    "Half a minute!",
    "Are we all here?",
    "Why, O why did I ever bring a wretched little hobbit on a treasure hunt!",
    "About turn!",
    "Draw your sword Thorin!",
    "Biter and Beater!",
    "So it is an elvish blade, too",
    "Go back?",
    "No good at all! Go sideways? Impossible! Go forward? Only thing to do! On we go!",
    "So it is a pool or a lake, and not an underground river",
    "Who are you?",
    "What iss he, my preciouss?",
    "A sword, a blade which came out of Gondolin!",
    "Very well",
    "You ask first",
    "Easy!",
    "Mountain, I suppose.",
    "All right!",
    "Chestnuts, chestnuts",
    "Half a moment!",
    "Wind, wind of course",
    "Ss, ss, ss",
    "Sss, sss, my preciouss",
    "Sun on the daisies it means, it does.",
    "Dark!",
    "Well, what is it?",
    "Well",
    "Eggses!",
    "Eggses it is!",
    "Is it nice, my preciousss? Is it juicy? Is it scrumptiously crunchable?",
    "Half a moment",
    "I gave you a good long chance just now.",
    "It must make haste, haste!",
    "Ugh!",
    "Fish! fish!",
    "It is fish!",
    "Give me more time! Give me time!",
    "Time! Time!",
    "Ask us! ask us!",
    "What have I got in my pocket?",
    "Not fair! not fair!",
    "What have I got in my pocket?",
    "It must give us three guesseses, my preciouss, three guesseses.",
    "Very well! Guess away!",
    "Handses!",
    "Wrong",
    "Guess again!",
    "Knife!",
    "Wrong!",
    "Last guess!",
    "Come on!",
    "I am waiting!",
    "String, or nothing!",
    "Both wrong",
    "Well?",
    "Never you mind",
    "A promise is a promise.",
    "Cross it is, impatient, precious",
    "Well, hurry up!",
    "Quite safe, yes",
    "Where iss it? Where iss it?",
    "Losst it is, my precious, lost, lost! Curse us and crush us, my precious is lost!",
    "What have you lost?",
    "Well, so am I",
    "Come along!",
    "No, not yet, precious!",
    "But you never guessed my last question, and you promised",
    "Never guessed!",
    "Answers were to be guessed not given",
    "Not a riddle, precious, no.",
    "What has it got in its pocketses?",
    "What have you lost?",
    "What has it got in its pocketses?",
    "What have I, I wonder?",
    "Curse it! curse it! curse it!",
    "What shall we do? Curse them and crush them! We must wait here, precious, wait a bit and see.",
    "Thief, thief, thief! Baggins! We hates it, we hates it, we hates it for ever!",
    "If goblins are so near that he smelt them",
    "A bit low for goblins, at least for the big ones",
    "Where is it?",
    "Go back up the passage!",
    "This way!",
    "That way!",
    "Look out for the door",
    "I must get to the door, I must get to the door!",
    "Good heavens!",
    "I seem to have got right to the other side of the Misty Mountains, right to the edge of the Land Beyond! Where and O where can Gandalf and the dwarves have got to? I only hope to goodness they are not still back there in the power of the goblins!",
    "I will give them all a surprise",
    "After all he is my friend",
    "He has been more trouble than use so far",
    "If we have got to go back now into those abominable tunnels to look for him, then drat him, I say.",
    "You would have dropped him",
    "Well, it is the first time that even a mouse has crept along carefully and quietly under my very nose and not been spotted",
    "Balin at your service",
    "What about the guards?",
    "What did I tell you?",
    "A very ticklish business, it was",
    "Touch and go!",
    "They made that gate ages ago",
    "We must be getting on at once, now we are a little rested",
    "O yes!",
    "I am dreadfully hungry",
    "No thank you!",
    "Well! that has got us on a bit",
    "I daresay",
    "Must we go any further?",
    "My toes are all bruised and bent, and my legs ache, and my stomach is wagging like an empty sack.",
    "A bit further",
    "What shall we do, what shall we do!",
    "Escaping goblins to be caught by wolves!",
    "Up the trees quick!",
    "Dori!",
    "What is all this uproar in the forest tonight?",
    "Go away! little boys!",
    "Now I know what a piece of bacon feels like when it is suddenly picked out of the pan on a fork and put back on the shelf!",
    "The Lord of the Eagles bids you to bring your prisoners to the Great Shelf",
    "They would shoot at us with their great bows of yew",
    "Very well",
    "I am nearly dead of it",
    "That can perhaps be mended",
    "Farewell!",
    "May the wind under your wings bear you where the sun sails and the moon walks",
    "I am not going to disappear this very instant",
    "We shall see, we shall see!",
    "And why is it called the Carrock?",
    "Who calls it? Who knows it?",
    "Is that the person you are taking us to now?",
    "Yes it certainly is! No I could not! And I was explaining very carefully",
    "Good gracious heavens, no, no, NO, NO!",
    "If one was to sting me",
    "I should swell up as big again as lam!",
    "We are getting near",
    "You had better wait here",
    "They have gone to tell him of the arrival of strangers",
    "Ugh! here they are!",
    "Who are you and what do you want?",
    "I am Gandalf",
    "Never heard of him",
    "I am a wizard",
    "Goblins?",
    "Or two? I can only see one, and a little one at that",
    "Go on, call away!",
    "One or three you meant, I see!",
    "Thorin Oakenshield, at your service! Dori at your service!",
    "They are on their way to visit the land of their fathers, away east beyond Mirkwood",
    "Go on telling, then!",
    "Do you call two several?",
    "Where are they? Killed, eaten, gone home?",
    "Hullo!",
    "As soon as we were asleep",
    "Troop, was right",
    "Balin and Dwalin",
    "Now go on again!",
    "Good!",
    "It is some good being a wizard, then.",
    "Sit down and be quiet! Now go on, Gandalf!",
    "I wish I had been there! I would have given them more than fireworks!",
    "Well",
    "Good heavens!",
    "And me!",
    "A very good tale!",
    "Yes please!",
    "Thank you very much!",
    "It is time for us to sleep",
    "Get up lazybones",
    "Breakfast!",
    "Where is breakfast?",
    "Mostly inside us",
    "Where is Gandalf?",
    "O! out and about somewhere",
    "Where is our host, and where have you been all day yourself?",
    "I will answer the second question first",
    "What shall we do",
    "So here you all are still!",
    "Little bunny is getting nice and fat again on bread and honey",
    "Come and have some more!",
    "It was a good story, that of yours",
    "What did you do with the goblin and the Warg?",
    "Come and see!",
    "But your way through Mirkwood is dark, dangerous and difficult",
    "The goblins",
    "Hush! Take no notice!",
    "Well, here is Mirkwood!",
    "What about the horse, then?",
    "What about your promise then?",
    "Now we had this all out before, when we landed on the Carrock",
    "Do we really have to go through?",
    "Yes, you do!",
    "No! no!",
    "Very comforting you are to be sure",
    "Insect eyes",
    "How far away do you think it is?",
    "Can any of you throw a rope?",
    "Dori is the strongest, but Fili is the youngest and still has the best sight",
    "Not far enough!",
    "Steady!",
    "Help!",
    "It was tied after all",
    "I shall",
    "Give me another length of rope and another hook",
    "Get in now",
    "Bombur has fallen in! Bombur is drowning!",
    "Stop! stop!",
    "Is there no end to this accursed forest?",
    "The forest goes on for ever and ever and ever in all directions! Whatever shall we do? And what is the use of sending a hobbit!",
    "Why ever did I wake up!",
    "You need not try",
    "Let your legs take their share, we have carried you far enough.",
    "Go on, if you must",
    "What was that? I thought I saw a twinkle of light in the forest.",
    "It looks as if my dreams were coming true",
    "A feast would be no good, if we never got back alive from it",
    "The lights are coming out again over there, and there are more than ever of them.",
    "Bilbo Baggins! Hobbit! You dratted hobbit! Hi! hobbit, confusticate you, where are you?",
    "I was having such a lovely dream",
    "Good heavens! he has gone like Bombur",
    "They are the best I am likely to get in this beastly place",
    "Dori, Nori, Ori, Oin, Gloin, Lili, Kili, Bombur, Bifur, Bofur, Dwalin, Balin, Thorin Oakenshield",
    "Bilbo!",
    "I will give you a name",
    "It was a sharp struggle, but worth it",
    "You were quite right",
    "Fili or Kili",
    "Most likely Fili",
    "Come down! Come down!",
    "I am going to disappear",
    "Go on! Go on!",
    "I will do the stinging!",
    "Where is Thorin?",
    "Why did you and your folk three times try to attack my people at their merrymaking?",
    "We did not attack them",
    "Where are your friends now, and what are they doing?",
    "What were you doing in the forest?",
    "Booking for food and drink, because we were starving.",
    "But what brought you into the forest at all?",
    "Very well!",
    "Take him away and keep him safe, until he feels inclined to tell the truth, even if he waits a hundred years.",
    "Besides they need no ropes in here",
    "There is no escape from my magic doors for those who are once brought inside.",
    "What have we done, O king?",
    "Is it a crime to be lost in the forest, to be hungry and thirsty, to be trapped by spiders? Are the spiders your tame beasts or your pets, if killing them makes you angry?",
    "Now come with me",
    "Very good",
    "No time now!",
    "Drat this dwarvish racket!",
    "Upon my word!",
    "We shall be bruised and battered to pieces, and drowned too, for certain!",
    "Very well!",
    "That will save him some of the trouble he is in for",
    "I shall be angry if the old slowcoach is late",
    "I have no wish to waste time down here while the song is up!",
    "Ha, ha!",
    "Shake him! Wake him!",
    "Small wonder",
    "Save us, Galion!",
    "Get on with the work!",
    "Very well, very well",
    "I do hope I put the lids on tight enough!",
    "This is a heavy load!",
    "No time now!",
    "Shove off!",
    "Well, are you alive or are you dead?",
    "I hope I never smell the smell of apples again!",
    "Well! Here we are!",
    "What else is there?",
    "Who are you and what do you want?",
    "Thorin son of Thrain son of Thror King under the Mountain!",
    "And who are these?",
    "If you come in peace lay down your arms!",
    "We have none",
    "He is at feast",
    "Then all the more reason for taking us to him",
    "Follow me then",
    "I am Thorin son of Thrain son of Thror King under the Mountain! I return!",
    "These are prisoners of our king that have escaped, wandering vagabond dwarves that could not give any good account of themselves, sneaking through the woods and molesting our people!",
    "Is this true?",
    "It is true that we were wrongfully waylaid by the Elvenking and imprisoned without cause as we journeyed back to our own land",
    "Thag you very buch.",
    "Let them go and bother Smaug, and see how he welcomes them!",
    "Not at any rate until the songs have come true!",
    "There lies all that is left of Dale",
    "Let us return!",
    "That does not prove it",
    "You said sitting on the doorstep and thinking would be my job, not to mention getting inside, so I am sitting and thinking.",
    "Tomorrow begins the last week of autumn",
    "And winter comes after autumn",
    "And next year after that",
    "Good Gracious!",
    "Perhaps the wizard will suddenly come back today",
    "The key! The key!",
    "Where is Thorin?",
    "The key!",
    "The key that went with the map! Try it now while there is still time!",
    "Good luck!",
    "Now you are in for it at last, Bilbo Baggins",
    "You went and put your foot right in it that night of the party, and now you have got to pull it out and pay for it! Dear me, what a fool I was and am!",
    "Is that a kind of a glow I seem to see coming right ahead down there?",
    "Quick! Quick!",
    "They will be slain, and all our ponies too, and all our stores lost",
    "We can do nothing.",
    "Nonsense!",
    "What else do you suppose a burglar is to do?",
    "Old Smaug is weary and asleep",
    "No thank you, O Smaug the Tremendous!",
    "Do you now?",
    "Truly songs and tales fall utterly short of the reality, O Smaug the Chiefest and Greatest of Calamities",
    "You have nice manners for a thief and a liar",
    "So I can well believe",
    "Lovely titles!",
    "I thought so last night",
    "Dwarves!",
    "I suppose you got a fair price for that cup last night?",
    "Not gold alone brought us hither.",
    "I tell you",
    "Revenge!",
    "My armour is like tenfold shields, my teeth are swords, my claws spears, the shock of my tail a thunderbolt, my wings a hurricane, and my breath death!",
    "I have always understood",
    "Your information is antiquated",
    "I might have guessed it",
    "Yes, it is rare and wonderful, indeed",
    "Look!",
    "What do you say to that?",
    "Dazzlingly marvellous! Perfect! Flawless! Staggering!",
    "Old fool! Why, there is a large patch in the hollow of his left breast as bare as a snail out of its shell!",
    "Well, I really must not detain Your Magnificence any longer",
    "Never laugh at live dragons, Bilbo you fool!",
    "Drat the bird!",
    "Leave him alone!",
    "Why what has happened?",
    "Do get on with your tale!",
    "Well, well! It cannot be helped, and it is difficult not to slip in talking to a dragon, or so I have always heard",
    "I am sure we are very unsafe here",
    "Why has not Smaug blocked the lower end, then, if he is so eager to keep us out? He has not, or we should have heard him.",
    "We knew it would be a desperate venture",
    "The Arkenstone! The Arkenstone!",
    "Shut the door!",
    "Let us try the door!",
    "We are trapped!",
    "Come, come!",
    "Now do be careful!",
    "Confound you, Smaug, you worm!",
    "Now I wonder what on earth Smaug is playing at",
    "Light!",
    "Can anybody make a light?",
    "Sh! sh!",
    "Now I am a burglar indeed!",
    "Only a bat, I suppose and hope!",
    "But now what am I to do? Which is East, South, North, or West?",
    "Thorin! Balin! Oin! Gloin! Fili! Kili!",
    "Now what on earth or under it has happened?",
    "Certainly not the dragon, or he would not go on squeaking.",
    "Come, one of you, get another light or two!",
    "It seems we have got to go and help our burglar.",
    "It is about our turn to help",
    "Only a bat and a dropped torch, nothing worse!",
    "Here is the first payment of your reward! Cast off your old coat and put on this!",
    "I feel magnificent",
    "I would give a good many of these precious goblets",
    "Thorin!",
    "You speak the truth!",
    "This is the great chamber of Thror",
    "There is the birth of the Running River",
    "Well!",
    "It seems to be late morning",
    "Quite right!",
    "How far is that?",
    "Dear me!",
    "More walking and more climbing without breakfast! I wonder how many breakfasts, and other meals, we have missed inside that nasty clockless, timeless hole?",
    "Come, come!",
    "We must move away from here",
    "I feel as if his eyes were on the back of my head.",
    "Come on! Come on!",
    "Here",
    "Not much use, if we have been seen coming here",
    "We must take our chance of that",
    "Hear, hear!",
    "Look!",
    "Perhaps the King under the Mountain is forging gold",
    "Which king?",
    "As like as not it is the marauding fire of the Dragon, the only king under the Mountain we have ever known.",
    "You are always foreboding gloomy things!",
    "The King beneath the Mountain!",
    "His wealth is like the Sun, his silver like a fountain, his rivers golden run! The river is running gold from the Mountain!",
    "The dragon is coming or I am a fool!",
    "Cut the bridges! To arms! To arms!",
    "Wait! Wait!",
    "Arrow!",
    "If only he had not been killed",
    "Bard is not lost!",
    "King Bard! King Bard!",
    "Girion was lord of Dale, not king of Esgaroth",
    "We will have King Bard!",
    "Up the Bowman, and down with Moneybags",
    "I am the last man to undervalue Bard the Bowman",
    "Fools!",
    "Why waste words and wrath on those unhappy creatures? Doubtless they perished first in fire, before Smaug came to us.",
    "Smaug is dead!",
    "That will be the last we shall hear of Thorin Oakenshield, I fear",
    "Something strange is happening",
    "There is that old thrush again!",
    "I believe he is trying to tell us something",
    "Not very well",
    "I only wish he was a raven!",
    "I thought you did not like them! You seemed very shy of them, when we came this way before.",
    "We may not understand him, but that old bird understands us, I am sure",
    "Keep watch now, and see what happens!",
    "O Thorin son of Thrain, and Balin son of Fundin",
    "Behold! the birds are gathering back again to the Mountain and to Dale from South and East and West, for word has gone out that Smaug is dead!",
    "Dead! Dead?",
    "Yes, dead",
    "I will not say if this counsel be good or bad",
    "Back now to the Mountain!",
    "We have little time to lose.",
    "And little food to use!",
    "Back to the Mountain!",
    "They have come!",
    "Who are you",
    "Who are you that come armed for war to the gates of Thorin son of Thrain, King under the Mountain?",
    "Who are you, and of what would you parley?",
    "You put your worst cause last and in the chief place",
    "It is in my mind to ask what share of their inheritance you would have paid to our kindred, had you found the hoard unguarded and us slain.",
    "A just question",
    "The Elvenking is my friend, and he has succoured the people of the Lake in their need, though they had no claim but friendship on him",
    "In the name of Esgaroth and the Forest",
    "Since such is your answer",
    "The whole place still stinks of dragon",
    "For the Arkenstone of my father",
    "But they cannot reach the Mountain unmarked",
    "Winter and snow will bite both men and elves",
    "It is mighty cold!",
    "I wish we could have a fire up here as they have in the camp!",
    "It is warm enough inside",
    "Not as stiff as my legs",
    "I would give a good deal for the feel of a strong drink in my throat, and for a soft bed after a good supper!",
    "Off you go!",
    "I will wake you at midnight, and you can wake the next watchman.",
    "That was no fish!",
    "Servant, indeed!",
    "I am here, if you want me!",
    "Indeed!",
    "Really you know",
    "A share in the profits, mind you",
    "Well, let him!",
    "Such a fool deserves to starve.",
    "Quite so",
    "Why do you tell us this? Are you betraying your friends, or are you threatening us?",
    "My dear Bard!",
    "Let us hear it!",
    "You may see it!",
    "It is this!",
    "This is the Arkenstone of Thrain",
    "But how is it yours to give?",
    "O well!",
    "Bilbo Baggins!",
    "Thank you very much I am sure",
    "There is always more about you than anyone expects!",
    "All in good time!",
    "That will be Dain!",
    "Hail Thorin!",
    "Are you still of the same mind?",
    "My mind does not change with the rising and setting of a few suns",
    "Is there then nothing for which you would yield any of your gold?",
    "Nothing that you or your friends have to offer.",
    "What of the Arkenstone of Thrain?",
    "Why should I purchase my own?",
    "We are not thieves",
    "Your own we will give back in return for our own.",
    "How came you by it?",
    "I gave it to them!",
    "You! You!",
    "By the beard of Durin! I wish I had Gandalf here! Curse him for his choice of you! May his beard wither! As for you I will throw you to the rocks!",
    "Stay! Your wish is granted!",
    "You all seem in league!",
    "Dear me! Dear me!",
    "I will",
    "I am betrayed",
    "Get down now to your friends!",
    "What about the gold and silver?",
    "That shall follow after, as can be arranged",
    "Get down!",
    "Until then we keep the stone",
    "You are not making a very splendid figure as King under the Mountain",
    "But things may change yet.",
    "They may indeed",
    "Farewell!",
    "We may meet again as friends.",
    "Be off!",
    "Not so hasty!",
    "We are sent from Dain son of Nain",
    "Fools!",
    "Halt!",
    "Halt!",
    "Come!",
    "To the Mountain!",
    "To the Mountain! Let us take our places while there is yet time!",
    "Moria!",
    "Dain, Dain!",
    "To me! To me! Elves and Men! To me! O my kinsfolk!",
    "It will not be long now",
    "The Eagles! The Eagles!",
    "The Eagles are coming!",
    "The Eagles! the Eagles!",
    "The Eagles!",
    "Now I wonder what has happened?",
    "Victory after all, I suppose!",
    "Well, it seems a very gloomy business.",
    "Hullo there!",
    "Hullo there! What news?",
    "What voice is it that speaks among the stones?",
    "It is well that I have found you!",
    "A nasty knock on the head, I think",
    "I will carry you down to the camp in the valley",
    "Baggins!",
    "Hail! Thorin",
    "I have brought him.",
    "Farewell, good thief",
    "Farewell, King under the Mountain!",
    "No!",
    "A mercy it is",
    "Where are the Eagles?",
    "Some are in the hunt",
    "As soon as you like",
    "There let it lie till the Mountain falls!",
    "May it bring good fortune to all his folk that dwell here after!",
    "We will honour the agreement of the dead, and he has now the Arkenstone in his keeping.",
    "Very kind of you",
    "That will be quite as much as I can manage",
    "Farewell, Balin!",
    "Farewell Thorin Oakenshield! And Fili and Kili! May your memory never fade!",
    "If ever you visit us again, when our halls are made fair once more, then the feast shall indeed be splendid!",
    "If ever you are passing my way",
    "Farewell! O Elvenking!",
    "Merry be the greenwood, while the world is yet young! And merry be all your folk!",
    "Farewell! O Gandalf!",
    "May you ever appear where you are most needed and least expected! The oftener you appear in my halls the better shall I be pleased!",
    "I beg of you",
    "In what way have I earned such a gift, O hobbit?",
    "I will take your gift, O Bilbo the Magnificent!",
    "So comes snow after fire, and even dragons have their ending!",
    "I wish now only to be in my own armchair!",
    "Ere long now",
    "It would be well indeed",
    "Well, Merry People!",
    "What time by the moon is this? Your lullaby would waken a drunken goblin! Yet I thank you.",
    "A little sleep does a great cure in the house of Elrond",
    "There is a long road yet",
    "But it is the last road",
    "I have enough to last me my time",
    "Indeed I can!",
    "But share and share alike! You may find you have more needs than you expect.",
    "My dear Bilbo!",
    "Something is the matter with you! You are not the hobbit that you were.",
    "Poor old Baggins!",
    "Come in! Come in!",
    "The new Master is of wiser kind",
    "Then the prophecies of the old songs have turned out to be true, after a fashion!",
    "Of course!",
    "Thank goodness!"
  ]
}